{
    "books":[
       {
          "author":"Anthony Weston",
          "averageRating":3.81,
          "categories":[
             "Reference"
          ],
          "collectionId":"fd09a1f9-c9bd-40e6-9aa0-65f578b5a446",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 11:20:52",
          "description":"A Rulebook for Arguments is a succinct introduction to the art of writing and assessing arguments, organized around specific rules, each illustrated and explained soundly but briefly. This widely popular primer--translated into eight languages--remains the first choice in all disciplines for writers who seek straightforward guidance about how to assess arguments and how to cogently construct them. The fourth edition offers a revamped and more tightly focused approach to extended arguments, a new chapter on oral arguments, and updated examples and topics throughout.",
          "goodReadsBookId":"6163873",
          "image":"https://books.google.com/books/content?id=pTCZjgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9780872209541",
          "pageCount":88,
          "publicationDate":"2009",
          "publisher":"Hackett Publishing",
          "ratingCount":2102,
          "title":"A Rulebook for Arguments"
       },
       {
          "author":"Randy J. Paterson",
          "averageRating":4.07,
          "categories":[
             "Self-Help"
          ],
          "collectionId":"1bf08b1d-313f-417e-b0d9-ac3d2bad015e",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:34:05",
          "description":"Effective communication is a critical skill that influences your professional success, the stability of your family life, and your personal happiness. Your ability to communicate effectively is seriously hampered if you can't assert yourself constructively. If you've ever felt paralyzed by an imposing individual or strongly argued opposing point of view, you know that a lack of assertiveness can leave you feeling marginalized and powerless. The Assertiveness Workbook contains effective, cognitive behavioral techniques to help you become more assertive. Learn how to set and maintain personal boundaries without becoming inaccessible. Become more genuine and open in relationships without fearing attack. Defend yourself when you are criticized or asked to submit to unreasonable requests. This book has been awarded The Association for Behavioral and Cognitive Therapies Self-Help Seal of Merit — an award bestowed on outstanding self-help books that are consistent with cognitive behavioral therapy (CBT) principles and that incorporate scientifically tested strategies for overcoming mental health difficulties. Used alone or in conjunction with therapy, our books offer powerful tools readers can use to jump-start changes in their lives.",
          "goodReadsBookId":"12067948",
          "image":"https://books.google.com/books/content?id=T1-QhcfFWQIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":true,
          "isLent":false,
          "isRead":true,
          "isbn":"9781608824168",
          "pageCount":216,
          "publicationDate":"2000-11-01",
          "publisher":"New Harbinger  Publications",
          "ratingCount":424,
          "title":"The Assertiveness Workbook"
       },
       {
          "author":"Gene O'Kelly",
          "averageRating":3.87,
          "categories":[
             "Biography & Autobiography"
          ],
          "collectionId":"ebf8db37-03b4-4b10-8d00-12fb3835137d",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:36:37",
          "description":"THE NEW YORK TIMES BESTSELLER Chasing Daylight is the honest, touching, and ultimately inspirational memoir of former KPMG CEO Eugene O'Kelley, completed in the three-and-a-half months between his diagnosis with brain cancer and his death in September 2005. Its haunting yet extraordinarily hopeful voice reminds us to embrace the fragile, fleeting moments of our lives-the brief time we have with our family, our friends, and even ourselves. This paperback edition features a new foreword by his wife, Corinne O'Kelley and a readers' group guide and questions. “Voicing universal truths . . . shared . . . simply and clearly.”-Janet Malin, New York Times “Words to live by.”-Kerry Hannon, USA Today “One of the most unexpected and touching books you're likely to read this year.”-Edward Nawotka, Bloomberg News “An honest, thought-provoking memoir . . . O'Kelly has many lessons to teach us on how to live.”-Steve Powers, Houston Chronicle “[A] well-written and moving book.”-TheEconomist.com",
          "goodReadsBookId":"1054207",
          "image":"https://books.google.com/books/content?id=l0SdeRvzTRoC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780071499934",
          "pageCount":160,
          "publicationDate":"2007-09-24",
          "publisher":"McGraw Hill Professional",
          "ratingCount":2300,
          "title":"Chasing Daylight: How My Forthcoming Death Transformed My Life"
       },
       {
          "author":"Kevin D. Mitnick",
          "averageRating":3.76,
          "categories":[
             "Computers"
          ],
          "collectionId":"ebf8db37-03b4-4b10-8d00-12fb3835137d",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 17:06:23",
          "description":"The world's most infamous hacker offers an insider's view of the low-tech threats to high-tech security Kevin Mitnick's exploits as a cyber-desperado and fugitive form one of the most exhaustive FBI manhunts in history and have spawned dozens of articles, books, films, and documentaries. Since his release from federal prison, in 1998, Mitnick has turned his life around and established himself as one of the most sought-after computer security experts worldwide. Now, in The Art of Deception, the world's most notorious hacker gives new meaning to the old adage, \"It takes a thief to catch a thief.\" Focusing on the human factors involved with information security, Mitnick explains why all the firewalls and encryption protocols in the world will never be enough to stop a savvy grifter intent on rifling a corporate database or an irate employee determined to crash a system. With the help of many fascinating true stories of successful attacks on business and government, he illustrates just how susceptible even the most locked-down information systems are to a slick con artist impersonating an IRS agent. Narrating from the points of view of both the attacker and the victims, he explains why each attack was so successful and how it could have been prevented in an engaging and highly readable style reminiscent of a true-crime novel. And, perhaps most importantly, Mitnick offers advice for preventing these types of social engineering hacks through security protocols, training programs, and manuals that address the human element of security.",
          "goodReadsBookId":"16340812",
          "image":"https://books.google.com/books/content?id=OIy4F-8b_uEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780764538391",
          "pageCount":368,
          "publicationDate":"2011-08-04",
          "publisher":"John Wiley & Sons",
          "ratingCount":5608,
          "title":"The Art of Deception"
       },
       {
          "author":"James R. Hansen",
          "averageRating":4.07,
          "categories":[
             "Biography & Autobiography"
          ],
          "collectionId":"ebf8db37-03b4-4b10-8d00-12fb3835137d",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-05-29 22:56:03",
          "description":"An authorized portrait of the first astronaut to set foot on the moon sheds light on other aspects of his career, from the honors he received as a naval aviator to the price he and his family paid for his professional dedication.",
          "goodReadsBookId":"16058606",
          "image":"https://books.google.com/books/content?id=rMS6JFuLgx4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781476727813",
          "pageCount":784,
          "publicationDate":"2012-11-27",
          "publisher":"Simon and Schuster",
          "ratingCount":3426,
          "title":"First Man"
       },
       {
          "author":"Marco Polo",
          "averageRating":3.57,
          "categories":[
             "History"
          ],
          "collectionId":"ebf8db37-03b4-4b10-8d00-12fb3835137d",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-05-31 20:09:20",
          "description":"The reissue of a facsimile of the classic 1926 edition of The Travels of Marco Polo. Beginning from the traditional lyrical Marsden translation, Komroff corrected it against Henry Yule's magisterial two-volume work, including a chapter missing from the Marsden. The artist Witold Gordon created 32 two-colour woodcut illustrations for the original edition, published again here for the first time in over fifty years. The Travels of Marco Polo remains a wondrous adventure narrative. Chronicling the thirteenth-century world from Venice, his birthplace, to the far reaches of Asia, Marco Polo tells of the foreign peoples he meets as he travels by foot, horse and boat through places including Persia, the land of the Tartars, Tibet, India and, most importantly, China.",
          "goodReadsBookId":"1477595",
          "image":"https://books.google.com/books/content?id=ypI0_xWRk-AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780871406576",
          "pageCount":370,
          "publicationDate":"2002",
          "publisher":"W. W. Norton & Company",
          "ratingCount":4771,
          "title":"The Travels of Marco Polo"
       },
       {
          "author":"Peter Freestone",
          "averageRating":3.74,
          "categories":[
             "Music"
          ],
          "collectionId":"ebf8db37-03b4-4b10-8d00-12fb3835137d",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-06-18 22:49:01",
          "description":"An intimate memoir of the flamboyant Queen singer by the man who knew him best. Peter Freestone was Freddie Mercury’s Personal Assistant for the last 12 years of his life. He lived with Mercury in London, Munich and New York, and he was with him when he died. In this book, the most intimate account of Mercury’s life ever written, he reveals the truth behind the scandalous rumours, the outrageous lifestyle and Mercury’s relationships with men, women and the other members of Queen. From the famous names – including Elton John, Kenny Everett, Elizabeth Taylor and Rod Stewart – to the shadowy army of lovers, fixers and hangers-on, Peter Freestone saw them all play their part in the tragi-comedy that was Freddie Mercury’s life. Freestone lived with Mercury in Europe and America for over a decade. From the East 50s apartment in New York to Kensington Lodge, the house in London where Mercury died – not to mention innumerable international hotel rooms and apartments in between – Freestone was always on hand to serve and protect the man he had first met in the Biba department store in the early 1970s. Then Queen was a largely unknown band. Soon it would be the most glitzy of glam rock bands. Freestone saw the fame arrive and with it the generosity, the excess, and the celebrity friends who came and went. “I was chief cook and bottle washer, waiter, butler, valet, secretary, amanuensis, cleaner, baby-sitter… and agony aunt,” he writes. “I shopped for him both at supermarkets and art markets, I travelled the world with him, I was with him at the highs and came through the lows with him. I saw the creative juices flow and I also saw the frustration when life wasn’t going well. I acted as his bodyguard when needed and in the end, of course, I was one of his nurses.” Freestone’s bet-selling account of a talented and extravagant star’s life and death is compelling, entertaining and ultimately, very touching. Illustrated with many photos from personal and Freestone’s own archives. Press Reviews“An entertaining and thought provoking read” – PRS for Music Sales “This collection of Freddie’s own words is the closest thing there is to an autobiography of a man with no regrets. The foreword is written by his mother” – reFRESH magazine, Leading Gay mag in the UK",
          "goodReadsBookId":"8509645",
          "image":"https://books.google.com/books/content?id=E2y6f_ReQOsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780857121271",
          "pageCount":276,
          "publicationDate":"2010-01-07",
          "publisher":"Omnibus Press",
          "ratingCount":1036,
          "title":"Freddie Mercury: An Intimate Memoir by the Man who Knew Him Best"
       },
       {
          "author":"Joe Navarro",
          "averageRating":3.91,
          "categories":[
             "Self-Help"
          ],
          "collectionId":"873ce0e7-c5d4-4677-b38f-cb32d58d53a1",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:48:37",
          "description":"He says that's his best offer. Is it? She says she agrees. Does she? The interview went great—or did it? He said he'd never do it again. But he did. Read this book and send your nonverbal intelligence soaring. Joe Navarro, a former FBI counterintelligence officer and a recognized expert on nonverbal behavior, explains how to \"speed-read\" people: decode sentiments and behaviors, avoid hidden pitfalls, and look for deceptive behaviors. You'll also learn how your body language can influence what your boss, family, friends, and strangers think of you. You will discover: The ancient survival instincts that drive body language Why the face is the least likely place to gauge a person's true feelings What thumbs, feet, and eyelids reveal about moods and motives The most powerful behaviors that reveal our confidence and true sentiments Simple nonverbals that instantly establish trust Simple nonverbals that instantly communicate authority Filled with examples from Navarro's professional experience, this definitive book offers a powerful new way to navigate your world.",
          "goodReadsBookId":"1173576",
          "image":"https://books.google.com/books/content?id=g3IkvgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9780061438295",
          "pageCount":272,
          "publicationDate":"2008-04-15",
          "publisher":"William Morrow Paperbacks",
          "ratingCount":18870,
          "title":"What Every BODY is Saying"
       },
       {
          "author":"Carol Kinsey Goman",
          "averageRating":3.63,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"873ce0e7-c5d4-4677-b38f-cb32d58d53a1",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 11:19:25",
          "description":"A management coach explains how personal space, physical gestures, posture, facial expression and eye contact communicate louder than words and can be used by leaders to strategically manage, motivate and lead global teams in the digital age.",
          "goodReadsBookId":"10263926",
          "image":"https://books.google.com/books/content?id=itE4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780470876367",
          "pageCount":278,
          "publicationDate":"2011-04-19",
          "publisher":"John Wiley & Sons",
          "ratingCount":424,
          "title":"The Silent Language of Leaders"
       },
       {
          "author":"Nick Morgan",
          "averageRating":3.77,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"873ce0e7-c5d4-4677-b38f-cb32d58d53a1",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 11:19:38",
          "description":"Explains how to use the unconscious mind to influence people, citing recent findings in brain and behavioral sciences as a way to use the hidden cues programmed into humans to apply and adjust leadership styles and directives.",
          "goodReadsBookId":"18211096",
          "image":"https://books.google.com/books/content?id=slRPAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9781422193501",
          "pageCount":262,
          "publicationDate":"2014",
          "publisher":"Harvard Business Press",
          "ratingCount":302,
          "title":"Power Cues"
       },
       {
          "author":"Barbara Pease",
          "averageRating":3.98,
          "categories":[
             "Self-Help"
          ],
          "collectionId":"873ce0e7-c5d4-4677-b38f-cb32d58d53a1",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 15:34:08",
          "description":"Available for the first time in the United States, this international bestseller reveals the secrets of nonverbal communication to give you confidence and control in any face-to-face encounter—from making a great first impression and acing a job interview to finding the right partner. It is a scientific fact that people’s gestures give away their true intentions. Yet most of us don’t know how to read body language– and don’t realize how our own physical movements speak to others. Now the world’s foremost experts on the subject share their techniques for reading body language signals to achieve success in every area of life. Drawing upon more than thirty years in the field, as well as cutting-edge research from evolutionary biology, psychology, and medical technologies that demonstrate what happens in the brain, the authors examine each component of body language and give you the basic vocabulary to read attitudes and emotions through behavior. Discover: • How palms and handshakes are used to gain control • The most common gestures of liars • How the legs reveal what the mind wants to do • The most common male and female courtship gestures and signals • The secret signals of cigarettes, glasses, and makeup • The magic of smiles–including smiling advice for women • How to use nonverbal cues and signals to communicate more effectively and get the reactions you want Filled with fascinating insights, humorous observations, and simple strategies that you can apply to any situation, this intriguing book will enrich your communication with and understanding of others–as well as yourself.",
          "goodReadsBookId":"7134207",
          "image":"https://books.google.com/books/content?id=z5d_8bAyW8AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780307483690",
          "pageCount":400,
          "publicationDate":"2008-11-12",
          "publisher":"Bantam",
          "ratingCount":21361,
          "title":"The Definitive Book of Body Language"
       },
       {
          "author":"Lionel Rose",
          "averageRating":3,
          "categories":[
             "Psychology"
          ],
          "collectionId":"873ce0e7-c5d4-4677-b38f-cb32d58d53a1",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 15:35:08",
          "description":"★ ★ ★ FOR A LIMITED TIME ONLY ★ ★ ★ Buy the Paperback and Get the eBook for FREE! Who Else Wants to Know What She's REALLY Thinking About RIGHT NOW? Did you know that we say far more with our bodies and faces than we ever do with our words? Body language is a huge part of human interaction - but it's often completely ignored or misunderstood. If you want to know how to read the signals she's giving you and find out if she's looking at you as more than just a chance meeting, then you've come to the right place. Would you like to tell at just a single glance exactly what's going on in her mind? Just like you, we're frustrated that all the books, resources and courses out there on body language focus on exactly the wrong thing: what a facial expression or a gesture means in isolation. That's not how it works - our body parts work in harmony to create an overall message. That's why we've written this book - because we know that the secret of finding out whether she's interested in you lies in more than just one pout or a flick of her hair. we want to show you how to understand her body so that she can finally get that message across to you. That message that she's been sending all along... Give Us ONE Day and We'll Hand You the Keys to Her Mind And we'll do it for less than the cost of a cosmopolitan. Even if you've never heard a single fact about body language before, you'll find out in this book what a powerful tool it can be both for you and for her. Knowing Whether She's Interested or Not in Just a Few Moments IS Possible, Even if You're a Complete Beginner You'll learn how to spot the most important signals and weigh them up in the right context to tell what she's trying to say. Within this guide, you'll discover: Why her eyes really are the windows to her soul What she's telling you through her gaze The secrets behind her smile Is it a good thing or a bad thing that she's touching you What it means when her gestures are exactly the same as yours How to use her body language to tell if she's interested now How to tell if she's still interested in you when you're in a relationship And a whole lot more... This Guide Will Save You Over $500 on a Useless Course You'll find plenty of courses out there for people who want to learn body language, but why would you risk wasting at least $500 and hours upon hours of your time on something that may or may not work? It's a no brainer - This proven guide to understanding female body language has EVERYTHING you need, for a fraction of the cost. Don't Just Take Our Word for It... We've been sharing our knowledge about body language for years. Here's what just a couple of people who have read this book had to say: \"It is concise, well-structured, and gives valid information that a purchaser of this book would be looking for. There is no wool over the eyes here - my smile says I like it, my lips say it is a must read! A++\" \"I would highly recommend every guy reading this book so they can understand their girlfriend, wife, or any women in their life\" 100% Ironclad Money-Back Guarantee If you finish this book and you still feel like you don't know if she's interested in you, simply click one button within 7 days and Amazon will return 100% of your money back. That's how confident we are that this book really WILL show you how to beat the dating game and win that woman once and for all. No risk, nothing to lose! Just scroll up now and click the BUY NOW button to get started right away!",
          "goodReadsBookId":"35685087",
          "image":"https://books.google.com/books/content?id=ZHFgAQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781520626451",
          "pageCount":88,
          "publicationDate":"2017-02-16",
          "publisher":"Secrets of Body Language",
          "ratingCount":1,
          "title":"Secrets of Body Language - Female Body Language. Learn to Tell If She's Interested Or Not!"
       },
       {
          "author":"Patrick King",
          "averageRating":3.86,
          "categories":[
             
          ],
          "collectionId":"873ce0e7-c5d4-4677-b38f-cb32d58d53a1",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 15:39:11",
          "description":"Do you struggle to hold eye contact? Does it make you feel unconfident, uncomfortable, and self-conscious? Or do you just want to appear more charismatic and confident?Then Superhuman Eye Contact has the insightful tips and innovative exercises you need to become an eye contact expert - overnight.If you are bad at eye contact, people will assume that you are creepy or untrustworthy. If you are merely average at eye contact, you won't be negative, yet you won't be memorable either. But if you are SUPERHUMAN at eye contact, you will instantly make an impression and have people clamoring for your attention.All this because of eye contact? Absolutely.If the amount of eye-related phrases in our vocabulary is any indication, (the eyes are the window to the soul...) yes! Eyes are what people use as a guide to your overall character. Mastering eye contact is essential to becoming the person you've always wanted to be.What tips and exercises from years of coaching eye contact will you learn?* The #1 obstacle to strong eye contact and the two best ways to crush it.* Exactly how and when to break eye contact gracefully.* How to alter your eye contact for meaningful flirting.* What your eyes should never be doing, though you probably do it daily.* How the direction someone looks in can determine their truthfulness.* How to adjust your eye contact according to emotional and physical space.Real, actionable advice that can actually affect your life.How will your daily life improve?* You will project an image of confidence and poise.* You will force others to respect you and your presence.* You will become more captivating without having to say a word.* Your charisma quotient will skyrocket.* Interactions with the opposite sex will improve tenfold, guaranteed.* Most importantly you will feel comfortable making eye contact with anyone, stranger or friend... and use it to make them comfortable with you.Don't hesitate to pick up your copy today by clicking the BUY NOW button at the top of this page!",
          "goodReadsBookId":"27741455",
          "image":"https://books.google.com/books/content?id=CyNRjgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781517688431",
          "pageCount":78,
          "publicationDate":"2015-10-06",
          "publisher":"CreateSpace",
          "ratingCount":7,
          "title":"Superhuman Eye Contact"
       },
       {
          "author":"Joe Navarro",
          "averageRating":3.87,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"873ce0e7-c5d4-4677-b38f-cb32d58d53a1",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 15:39:52",
          "description":"Successfully navigate the business world by understanding what your manager and coworkers are really thinking. The secret is nonverbal intelligence—the ability to interpret and use nonverbal signals in business to assess and influence others. In Louder Than Words, bestselling author and behavior expert Joe Navarro shows you how to decode what's really being said at meetings, interviews, negotiations, presentations, business meals, and more, including the casual exchanges that often impact decisions and reputations. You can jump-start your career, close the deal, keep your customers, secure new ones, and lead your company with confidence once you discover how to: Read body language and discern non-verbal cues of concern, disagreement, or doubt—even over the phone Master the all-important first impression and use settings, seating, and gestures to inspire and captivate Recognize habits that send the wrong message—and learn what postures, work practices, work spaces, and even electronic habits say about people",
          "goodReadsBookId":"8775738",
          "image":"https://books.google.com/books/content?id=lyYvN0OJsZ4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780062015044",
          "pageCount":256,
          "publicationDate":"2011-03-08",
          "publisher":"Harper Collins",
          "ratingCount":687,
          "title":"Louder Than Words"
       },
       {
          "author":"Philip Houston",
          "averageRating":3.91,
          "categories":[
             "Language Arts & Disciplines"
          ],
          "collectionId":"873ce0e7-c5d4-4677-b38f-cb32d58d53a1",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 15:41:27",
          "description":"Three former CIA officers share their techniques for lie detection, outlining methods for identifying deceptiveness as revealed by verbal and non-verbal behaviors from facial expressions and grooming gestures to invoking religion and using qualifying language.",
          "goodReadsBookId":"16045157",
          "image":"https://books.google.com/books/content?id=FG1tAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781250029621",
          "pageCount":272,
          "publicationDate":"2013-07-16",
          "publisher":"Macmillan",
          "ratingCount":4505,
          "title":"Spy the Lie"
       },
       {
          "author":"Robert B. Cialdini",
          "averageRating":4.19,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"873ce0e7-c5d4-4677-b38f-cb32d58d53a1",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 15:41:58",
          "description":"\"Learn the six psychological secrets behind our powerful impulse to comply.\" - cover.",
          "goodReadsBookId":"479628",
          "image":"https://books.google.com/books/content?id=mTYj9XUlYvMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780688128166",
          "pageCount":320,
          "publicationDate":"1993",
          "publisher":"Harper Collins",
          "ratingCount":89923,
          "title":"Influence (rev)"
       },
       {
          "author":"Paul Jarvis",
          "averageRating":3.95,
          "categories":[
             
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:34:35",
          "description":"What if the real key to a richer and more fulfilling career was not to create and scale up a new business, but rather, to be able to work for yourself, determine your own hours and become a (highly profitable) and sustainable company of one? Suppose the better-and smarter-solution is simply to remain small? Company of One is a refreshing new approach centered on staying small and avoiding growth, for any size of business. Not as a freelancer who only gets paid on a per piece basis, and not as an entrepreneurial start-up that wants to scale up as soon as possible, but as a small business that is deliberately committed to staying that way. By staying small, you can have freedom to pursue more meaningful pleasures in life, and avoid the headaches that result from dealing with employees, long meetings, or worrying about expansion. Company of One introduces this unique business strategy and explains how to make it work for you, including how to generate cash flow on an ongoing basis. Paul Jarvis left the corporate world when he realized that working in a high-pressure, high-profile world was not his idea of success. Instead, he now works for himself out of his home, and lives a much more rewarding and productive life. He no longer has to contend with an environment that constantly demands more productivity, more output and more growth. In Company of One, Jarvis explains how you can do the same, including planning to set up, determining desired revenues and keeping clients happy, and of course, doing all this on your own.",
          "goodReadsBookId":"40607493",
          "image":"https://books.google.com/books/content?id=fU9vuQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":true,
          "isLent":false,
          "isRead":true,
          "isbn":"9780241380222",
          "pageCount":272,
          "publicationDate":"2019-01-08",
          "publisher":"Portfolio",
          "ratingCount":1400,
          "title":"Company of One"
       },
       {
          "author":"Gene Kim",
          "averageRating":4.27,
          "categories":[
             "BUSINESS & ECONOMICS"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:37:23",
          "description":"Bill has 90 days to fix a behind-schedule IT project, or his entire department will be outsourced. Fortunately, he has the help of a prospective board member, whose \"Three Ways\" philosophy might just save the day.",
          "goodReadsBookId":"35469581",
          "image":"https://books.google.com/books/content?id=_EnZAQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9781942788294",
          "pageCount":432,
          "publicationDate":"2018-02-27",
          "publisher":"IT REVOLUTION Press",
          "ratingCount":24903,
          "title":"The Phoenix Project"
       },
       {
          "author":"Jerold Panas",
          "averageRating":0,
          "categories":[
             
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:39:32",
          "description":"",
          "goodReadsBookId":"",
          "image":"https://books.google.com/books/content?id=S7qjtwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":true,
          "isLent":false,
          "isRead":true,
          "isbn":"9781607382614",
          "pageCount":0,
          "publicationDate":"2018",
          "publisher":"",
          "ratingCount":0,
          "title":"Preguntas que valen oro / Power Questions"
       },
       {
          "author":"Michelle Tillis Lederman",
          "averageRating":0,
          "categories":[
             "Business networks"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:41:22",
          "description":"\"Todos sabemos que la creación de redes (networking) es importante para obtener el éxito en cualquier negocio. Pero todas esas estrategias de mercadeo que leemos son a veces muy difíciles de aplicar. ¿No sería genial poder construir unas redes de contactos de una forma más relajada y auténtica? Esta obra le mostrará cómo construir redes de mercadeo de una forma sencilla y sin dolor, basada en un verdad simple: La gente hace negocios por personas que les agradan. Esta obra le va a en enseñar cómo identificar y potenciar las características que generan más agrado en los demaás y adicionalmente también aprenderán a: Iniciar y mantener conversaciones con facilidad; . conocer las preferencias de otros y observar nuevos estilos de vida que permitan relaciones recíprocas; permanecer en la mente de los demás, inclusive después del primer encuentro, y hacer lo necesario para construir nuevas relaciones interpersonales\"--P. [4] of cocver.",
          "goodReadsBookId":"",
          "image":"httpss://mobileappresources.s3.eu-north-1.amazonaws.com/BookReviewApp/cover_image.jpg",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9781607381426",
          "pageCount":228,
          "publicationDate":"2012",
          "publisher":"",
          "ratingCount":0,
          "title":"11 Principios Para Ganarse la Confianza Y El Aprecio de Los Demás"
       },
       {
          "author":"Ben Horowitz",
          "averageRating":4.24,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:44:16",
          "description":"A lot of people talk about how great it is to start a business, but only Ben Horowitz is brutally honest about how hard it is to run one. In The Hard Thing About Hard Things, Ben Horowitz, cofounder of Andreessen Horowitz and one of Silicon Valley's most respected and experienced entrepreneurs, draws on his own story of founding, running, selling, buying, managing, and investing in technology companies to offer essential advice and practical wisdom for navigating the toughest problems business schools don't cover. His blog has garnered a devoted following of millions of readers who have come to rely on him to help them run their businesses. A lifelong rap fan, Horowitz amplifies business lessons with lyrics from his favorite songs and tells it straight about everything from firing friends to poaching competitors, from cultivating and sustaining a CEO mentality to knowing the right time to cash in. His advice is grounded in anecdotes from his own hard-earned rise—from cofounding the early cloud service provider Loudcloud to building the phenomenally successful Andreessen Horowitz venture capital firm, both with fellow tech superstar Marc Andreessen (inventor of Mosaic, the Internet's first popular Web browser). This is no polished victory lap; he analyzes issues with no easy answers through his trials, including demoting (or firing) a loyal friend; whether you should incorporate titles and promotions, and how to handle them; if it's OK to hire people from your friend's company; how to manage your own psychology, while the whole company is relying on you; what to do when smart people are bad employees; why Andreessen Horowitz prefers founder CEOs, and how to become one; whether you should sell your company, and how to do it. Filled with Horowitz's trademark humor and straight talk, and drawing from his personal and often humbling experiences, The Hard Thing About Hard Things is invaluable for veteran entrepreneurs as well as those aspiring to their own new ventures.",
          "goodReadsBookId":"18176747",
          "image":"https://books.google.com/books/content?id=suNOrgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9780062273208",
          "pageCount":304,
          "publicationDate":"2014-03-04",
          "publisher":"HarperBusiness",
          "ratingCount":46678,
          "title":"The Hard Thing About Hard Things"
       },
       {
          "author":"Jacquie McNish",
          "averageRating":4.04,
          "categories":[
             
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:45:05",
          "description":"Shortlisted for the FT/McKinsey Business Book of the Year Award 2015. In 2009, BlackBerry controlled half of the US smartphone market. Today that number is less than one per cent. What went so wrong? Losing the Signal is the riveting story of a company that toppled global giants before succumbing to the ruthlessly competitive forces of Silicon Valley. This is not a conventional tale of modern business failure by fraud and greed; instead, the rise and fall of BlackBerry reveals the dangerous speed at which innovators race along the information superhighway. With unprecedented access to key players, senior executives, directors, and competitors, Losing the Signal unveils the remarkable rise of a company that started above a bagel store in a small Canadian city and went on to control half of the US smartphone market. However, at the very moment BlackBerry was ranked the worldâe(tm)s fastest-growing company, internal feuds and chaotic growth crippled the company as it faced its gravest test: the entry of Apple and Google into the mobile phone market. Expertly told by acclaimed journalists Jacquie McNish and Sean Silcoff, this is an entertaining, whirlwind narrative that goes behind the scenes to reveal one of the most compelling business stories of the new century.",
          "goodReadsBookId":"27252436",
          "image":"https://books.google.com/books/content?id=Yr52jgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9781847941725",
          "pageCount":288,
          "publicationDate":"2015-11-05",
          "publisher":"Random House Business Books",
          "ratingCount":2994,
          "title":"Losing the Signal"
       },
       {
          "author":"Harvard Business Review",
          "averageRating":4.03,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:45:54",
          "description":"Business.",
          "goodReadsBookId":"8308501",
          "image":"https://books.google.com/books/content?id=_9xbj9I3Sb8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9781422157992",
          "pageCount":185,
          "publicationDate":"2010",
          "publisher":"Harvard Business Press",
          "ratingCount":2754,
          "title":"HBR's 10 Must Reads on Managing Yourself"
       },
       {
          "author":"Eric Ries",
          "averageRating":4.08,
          "categories":[
             "Consumers' preferences"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:47:31",
          "description":"\"Most startups are built to fail. But those failures, according to entrepreneur Eric Ries, are preventable. Startups don't fail because of bad execution, or missed deadlines, or blown budgets. They fail because they are building something nobody wants. Whether they arise from someone's garage or are created within a mature Fortune 500 organization, new ventures, by definition, are designed to create new products or services under conditions of extreme uncertainly. Their primary mission is to find out what customers ultimately will buy. One of the central premises of The Lean Startup movement is what Ries calls \"validated learning\" about the customer. It is a way of getting continuous feedback from customers so that the company can shift directions or alter its plans inch by inch, minute by minute. Rather than creating an elaborate business plan and a product-centric approach, Lean Startup prizes testing your vision continuously with your customers and making constant adjustments\"--",
          "goodReadsBookId":"12969025",
          "image":"https://books.google.com/books/content?id=Iu5PtQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9780670921607",
          "pageCount":320,
          "publicationDate":"2011",
          "publisher":"",
          "ratingCount":199025,
          "title":"The Lean Startup"
       },
       {
          "author":"Gabriel Weinberg",
          "averageRating":4.15,
          "categories":[
             
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:50:38",
          "description":"Why do so many startups fail? According to entrepreneurs Gabriel Weinberg and Justin Mares, most failed startups make the fatal mistake of putting all their effort into perfecting their product at the cost of reaching out to potential users. Instead, they should be putting half their resources into getting traction. Tractionis the essential guide for any startup looking to stay ahead of the curve and start building a user base early in the game. The book offers no one-size-fits-all solution: every startup is unique, so no single method is guaranteed to generate traction. Instead, the authors identify nineteen different traction channels, from viral marketing to trade shows. They offer insights on how to exploit each one to its fullest potential, and provide a framework to test various channels and identify the best one for any startup.",
          "goodReadsBookId":"26370190",
          "image":"https://books.google.com/books/content?id=sNyBrgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9780241242537",
          "pageCount":240,
          "publicationDate":"2015-10-01",
          "publisher":"Portfolio (Hardcover)",
          "ratingCount":6338,
          "title":"Traction"
       },
       {
          "author":"Dr. Camilo Cruz",
          "averageRating":0,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:53:16",
          "description":"Todo emprendedor que comienza un negocio, lo hace con la intensión de ganar dinero, construir una empresa que perdure y asegurar su libertad financiera. Sin embargo, la realidad es que no todo nuevo empresario triunfa y alcanza la libertad financiera, no toda historia de emprendimiento tiene un final feliz. De hecho, algunas personas terminan en peores circunstancias de las que enfrentaban antes de iniciarse en el mundo de los negocios. ¿A qué se debe que muchos empresarios se mantengan financieramente pobres pese a tener frente así oportunidades de negocio con el potencial de brindarles la libertad financiera que ellos buscan? El fracaso de muchos empresarios ha sido el resultado de cometer, muchas veces inconscientemente, alguno de los siete errores financieros discutidos en este libro: •Empresarios con mentalidad de empleados •El pobre manejo de las finanzas personales •No invierten en su desarrollo personal •El control incorrecto de las finanzas del negocio •Metas borrosas e imprecisas para su negocio •La pobre inversión de su tiempo •No aprenden a invertir las ganancias de su negocio Quien desee construir una empresa exitosa debe evitar caer en cualquiera de estas trampas que puede convertir el noble sueño de ser empresario en una gran pesadilla.",
          "goodReadsBookId":"",
          "image":"https://books.google.com/books/content?id=WynEDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":true,
          "isLent":false,
          "isRead":true,
          "isbn":"9781607382584",
          "pageCount":144,
          "publicationDate":"2019-02-08",
          "publisher":"Taller del Éxito",
          "ratingCount":0,
          "title":"7 errores financieros que comenten los empresarios del multinivel y venta directa"
       },
       {
          "author":"Carl J. Schramm",
          "averageRating":4,
          "categories":[
             
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:55:11",
          "description":"How would you like to get business startup advice straight from the man who co-founded Global Entrepreneurship Week and StartUp America? Well now you can. Carl Schramm, the man described by The Economist as 'The Evangelist of Entrepreneurship', has written a myth-busting guide packed with tools and techniques to help you get your big idea off the ground. Carl believes that entrepreneurship has been completely misrepresented by the media, business books, university programmes and MBA courses. He believes that the perception of what it takes to start a business no longer matches the reality - which is bad news for everyone because it stops great ideas coming to life. Burn the Business Plan punctures the myth of the cool, tech-savvy 20-something entrepreneur with nothing to lose and venture capital to burn, showing that most people who start businesses are juggling careers and mortgages just like you. Burn the Business Plan is written to encourage you to get started. It demystifies the entrepreneurial process portrayed on television shows like Dragon's Den. It doesn't rely on largely irrelevant stories of overvalued tech startups, nor does it build on the largely mistaken narrative of a linear path from cold start to great success that is the essence of business planning, as taught in universities. This is the guide to starting and running a business that will actually work for the rest of us. Burn the Business Plan is for regular people who just want practical, real-world advice on how to start and run a successful business. It shows you how to avoid the common mistakes and what you need to do to put your enterprise on track for success.",
          "goodReadsBookId":"44144856",
          "image":"https://books.google.com/books/content?id=cLd2tAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9781473606913",
          "pageCount":288,
          "publicationDate":"2018-01-08",
          "publisher":"John Murray Learning",
          "ratingCount":3,
          "title":"Burn the Business Plan"
       },
       {
          "author":"Rob Walling",
          "averageRating":3.97,
          "categories":[
             "Entrepreneurship"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 11:18:27",
          "description":"Start Small, Stay Small is a step-by-step guide to launching a self-funded startup. If you're a desktop, mobile or web developer, this book is your blueprint to getting your startup off the ground with no outside investment. This book intentionally avoids topics restricted to venture-backed startups such as: honing your investment pitch, securing funding, and figuring out how to use the piles of cash investors keep placing in your lap. This book assumes: * You don't have $6M of investor funds sitting in your bank account * You're not going to relocate to the handful of startup hubs in the world * You're not going to work 70 hour weeks for low pay with the hope of someday making millions from stock options There's nothing wrong with pursuing venture funding and attempting to grow fast like Amazon, Google, Twitter, and Facebook. It just so happened that most people are not in a place to do this. Start Small, Stay Small also focuses on the single most important element of a startup that most developers avoid: marketing. There are many great resources for learning how to write code, organize source control, or connect to a database. This book does not cover the technical aspects developers already know or can learn elsewhere. It focuses on finding your idea, testing it before you build, and getting it into the hands of your customers.",
          "goodReadsBookId":"8508360",
          "image":"https://books.google.com/books/content?id=XYBhUjyi-WYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9780615373966",
          "pageCount":202,
          "publicationDate":"2010",
          "publisher":"The Numa Group LLC",
          "ratingCount":1656,
          "title":"Start Small, Stay Small"
       },
       {
          "author":"John Carreyrou",
          "averageRating":4.45,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:29:57",
          "description":"NEW YORK TIMES BEST SELLER • NAMED ONE OF THE BEST BOOKS OF THE YEAR BY: NPR, The New York Times Book Review, Time, Wall Street Journal, Washington Post • The McKinsey Business Book of the Year The full inside story of the breathtaking rise and shocking collapse of Theranos, the one-time multibillion-dollar biotech startup founded by Elizabeth Holmes—now the subject of the HBO documentary The Inventor—by the prize-winning journalist who first broke the story and pursued it to the end. “The story is even crazier than I expected, and I found myself unable to put it down once I started. This book has everything: elaborate scams, corporate intrigue, magazine cover stories, ruined family relationships, and the demise of a company once valued at nearly $10 billion.” —Bill Gates In 2014, Theranos founder and CEO Elizabeth Holmes was widely seen as the female Steve Jobs: a brilliant Stanford dropout whose startup “unicorn” promised to revolutionize the medical industry with a machine that would make blood testing significantly faster and easier. Backed by investors such as Larry Ellison and Tim Draper, Theranos sold shares in a fundraising round that valued the company at more than $9 billion, putting Holmes’s worth at an estimated $4.7 billion. There was just one problem: The technology didn’t work. A riveting story of the biggest corporate fraud since Enron, a tale of ambition and hubris set amid the bold promises of Silicon Valley.",
          "goodReadsBookId":"40677273",
          "image":"https://books.google.com/books/content?id=CcJFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781524731663",
          "pageCount":352,
          "publicationDate":"2018-05-21",
          "publisher":"Vintage",
          "ratingCount":136994,
          "title":"Bad Blood"
       },
       {
          "author":"Emily Chang",
          "averageRating":4,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:30:22",
          "description":"Instant National Bestseller \"Excellent.\" --San Francisco Chronicle \"Brotopia is more than a business book. Silicon Valley holds extraordinary power over our present lives as well as whatever utopia (or nightmare) might come next.\" --New York Times Silicon Valley is a modern utopia where anyone can change the world. Unless you're a woman. For women in tech, Silicon Valley is not a fantasyland of unicorns, virtual reality rainbows, and 3D-printed lollipops, where millions of dollars grow on trees. It's a \"Brotopia,\" where men hold all the cards and make all the rules. Vastly outnumbered, women face toxic workplaces rife with discrimination and sexual harassment, where investors take meetings in hot tubs and network at sex parties. In this powerful exposé, Bloomberg TV journalist Emily Chang reveals how Silicon Valley got so sexist despite its utopian ideals, why bro culture endures despite decades of companies claiming the moral high ground (Don't Be Evil! Connect the World!)--and how women are finally starting to speak out and fight back. Drawing on her deep network of Silicon Valley insiders, Chang opens the boardroom doors of male-dominated venture capital firms like Kleiner Perkins, the subject of Ellen Pao's high-profile gender discrimination lawsuit, and Sequoia, where a partner once famously said they \"won't lower their standards\" just to hire women. Interviews with Facebook COO Sheryl Sandberg, YouTube CEO Susan Wojcicki, and former Yahoo! CEO Marissa Mayer--who got their start at Google, where just one in five engineers is a woman--reveal just how hard it is to crack the Silicon Ceiling. And Chang shows how women such as former Uber engineer Susan Fowler, entrepreneur Niniane Wang, and game developer Brianna Wu, have risked their careers and sometimes their lives to pave a way for other women. Silicon Valley's aggressive, misogynistic, work-at-all costs culture has shut women out of the greatest wealth creation in the history of the world. It's time to break up the boys' club. Emily Chang shows us how to fix this toxic culture--to bring down Brotopia, once and for all.",
          "goodReadsBookId":"41272975",
          "image":"https://books.google.com/books/content?id=W8CGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780525540175",
          "pageCount":336,
          "publicationDate":"2019-03-05",
          "publisher":"Portfolio",
          "ratingCount":4195,
          "title":"Brotopia"
       },
       {
          "author":"Gary Klein",
          "averageRating":3.62,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:35:53",
          "description":"A renowned cognitive psychologist reveals the science behind achieving breakthrough discoveries, allowing readers to confidently solve problems, improve decision-making, and achieve success. Insights-like Darwin's understanding of the way evolution actually works, and Watson and Crick's breakthrough discoveries about the structure of DNA-can change the world. Yet we know very little about when, why, or how insights are formed-or what blocks them. In Seeing What Others Don't, Gary Klein unravels the mystery. Klein is a keen observer of people in their natural settings-scientists, businesspeople, firefighters, police officers, soldiers, family members, friends, himself-and uses a marvelous variety of stories to illuminate his research into what insights are and how they happen. What, for example, enabled Harry Markopolos to put the finger on Bernie Madoff? How did Dr. Michael Gottlieb make the connections between different patients that allowed him to publish the first announcement of the AIDS epidemic? How did Martin Chalfie come up with a million-dollar idea (and a Nobel Prize) for a natural flashlight that enabled researchers to look inside living organisms to watch biological processes in action? Klein also dissects impediments to insight, such as when organizations claim to value employee creativity and to encourage breakthroughs but in reality block disruptive ideas and prioritize avoidance of mistakes. Or when information technology systems are \"dumb by design\" and block potential discoveries. Both scientifically sophisticated and fun to read, Seeing What Others Don't shows that insight is not just a \"eureka!\" moment but a whole new way of understanding.",
          "goodReadsBookId":"18691733",
          "image":"https://books.google.com/books/content?id=urDzCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781610392754",
          "pageCount":304,
          "publicationDate":"2013-06-25",
          "publisher":"PublicAffairs",
          "ratingCount":1416,
          "title":"Seeing What Others Don't"
       },
       {
          "author":"Marty Cagan",
          "averageRating":4.24,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 17:02:12",
          "description":"How do today’s most successful tech companies—Amazon, Google, Facebook, Netflix, Tesla—design, develop, and deploy the products that have earned the love of literally billions of people around the world? Perhaps surprisingly, they do it very differently than the vast majority of tech companies. In INSPIRED, technology product management thought leader Marty Cagan provides readers with a master class in how to structure and staff a vibrant and successful product organization, and how to discover and deliver technology products that your customers will love—and that will work for your business. With sections on assembling the right people and skillsets, discovering the right product, embracing an effective yet lightweight process, and creating a strong product culture, readers can take the information they learn and immediately leverage it within their own organizations—dramatically improving their own product efforts. Whether you’re an early stage startup working to get to product/market fit, or a growth-stage company working to scale your product organization, or a large, long-established company trying to regain your ability to consistently deliver new value for your customers, INSPIRED will take you and your product organization to a new level of customer engagement, consistent innovation, and business success. Filled with the author’s own personal stories—and profiles of some of today’s most-successful product managers and technology-powered product companies, including Adobe, Apple, BBC, Google, Microsoft, and Netflix—INSPIRED will show you how to turn up the dial of your own product efforts, creating technology products your customers love. The first edition of INSPIRED, published ten years ago, established itself as the primary reference for technology product managers, and can be found on the shelves of nearly every successful technology product company worldwide. This thoroughly updated second edition shares the same objective of being the most valuable resource for technology product managers, yet it is completely new—sharing the latest practices and techniques of today’s most-successful tech product companies, and the men and women behind every great product.",
          "goodReadsBookId":"35415573",
          "image":"https://books.google.com/books/content?id=S8Q_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781119387565",
          "pageCount":368,
          "publicationDate":"2017-11-20",
          "publisher":"John Wiley & Sons",
          "ratingCount":9805,
          "title":"INSPIRED"
       },
       {
          "author":"Gene Kim",
          "averageRating":4.19,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 17:03:15",
          "description":"The Phoenix Project wowed over a half-million readers. Now comes The Unicorn Project! “The Unicorn Project is amazing, and I loved it 100 times more than The Phoenix Project…”—FERNANDO CORNAGO, Senior Director Platform Engineering, Adidas “Gene Kim does a masterful job of showing how … the efforts of many create lasting business advantages for all.”—DR. STEVEN SPEAR, author of The High-Velocity Edge, Sr. Lecturer at MIT, and principal of HVE LLC. “The Unicorn Project is so clever, so good, so crazy enlightening!”––CORNELIA DAVIS, Vice President Of Technology at Pivotal Software, Inc., Author of Cloud Native Patterns This highly anticipated follow-up to the bestselling title The Phoenix Project takes another look at Parts Unlimited, this time from the perspective of software development. In The Unicorn Project, we follow Maxine, a senior lead developer and architect, as she is exiled to the Phoenix Project, to the horror of her friends and colleagues, as punishment for contributing to a payroll outage. She tries to survive in what feels like a heartless and uncaring bureaucracy and to work within a system where no one can get anything done without endless committees, paperwork, and approvals. One day, she is approached by a ragtag bunch of misfits who say they want to overthrow the existing order, to liberate developers, to bring joy back to technology work, and to enable the business to win in a time of digital disruption. To her surprise, she finds herself drawn ever further into this movement, eventually becoming one of the leaders of the Rebellion, which puts her in the crosshairs of some familiar and very dangerous enemies. The Age of Software is here, and another mass extinction event looms—this is a story about rebel developers and business leaders working together, racing against time to innovate, survive, and thrive in a time of unprecedented uncertainty...and opportunity. “The Unicorn Project provides insanely useful insights on how to improve your technology business.”—DOMINICA DEGRANDIS, author of Making Work Visible and Director of Digital Transformation at Tasktop ——— “My goal in writing The Unicorn Project was to explore and reveal the necessary but invisible structures required to make developers (and all engineers) productive, and reveal the devastating effects of technical debt and complexity. I hope this book can create common ground for technology and business leaders to leave the past behind, and co-create a better future together.”—Gene Kim, November 2019",
          "goodReadsBookId":"45293317",
          "image":"https://books.google.com/books/content?id=kNSSDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781942788775",
          "pageCount":352,
          "publicationDate":"2019-11-26",
          "publisher":"IT Revolution",
          "ratingCount":2083,
          "title":"The Unicorn Project"
       },
       {
          "author":"Emrah Yayici",
          "averageRating":3.67,
          "categories":[
             
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 17:03:43",
          "description":"Business Analyst's Mentor Book includes tips and best practices in a broad range of topics like: Business analysis techniques and tools Agile and waterfall methodologies Scope management Change request management Conflict management Use cases UML Requirements gathering and documentation User interface design Usability testing Software testing Automation tools Real-life examples are provided to help readers apply these best practices in their own IT organizations. The book also answers the most frequent questions of business analysts regarding software requirements management.",
          "goodReadsBookId":"18456140",
          "image":"https://books.google.com/books/content?id=By6dngEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9786058603714",
          "pageCount":106,
          "publicationDate":"2013-07-22",
          "publisher":"",
          "ratingCount":143,
          "title":"Business Analyst's Mentor Book"
       },
       {
          "author":"Jeffrey K. Liker",
          "averageRating":4.07,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 17:04:09",
          "description":"How to speed up business processes, improve quality, and cut costs in any industry In factories around the world, Toyota consistently makes the highest-quality cars with the fewest defects of any competing manufacturer, while using fewer man-hours, less on-hand inventory, and half the floor space of its competitors. The Toyota Way is the first book for a general audience that explains the management principles and business philosophy behind Toyota's worldwide reputation for quality and reliability. Complete with profiles of organizations that have successfully adopted Toyota's principles, this book shows managers in every industry how to improve business processes by: Eliminating wasted time and resources Building quality into workplace systems Finding low-cost but reliable alternatives to expensive new technology Producing in small quantities Turning every employee into a qualitycontrol inspector",
          "goodReadsBookId":"9058619",
          "image":"https://books.google.com/books/content?id=eZutzPww02EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780071435635",
          "pageCount":350,
          "publicationDate":"2003-12-22",
          "publisher":"McGraw Hill Professional",
          "ratingCount":7064,
          "title":"The Toyota Way"
       },
       {
          "author":"Sydney Finkelstein",
          "averageRating":3.66,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 17:04:59",
          "description":"Bob Pittman and AOL Time Warner. Jean Marie Messier and Vivendi. Jill Barad and Mattel. Dennis Kozlowski and Tyco. It's an all too common scenario. A great company breaks from the pack; the analysts are in love; the smiling CEO appears on the cover of Fortune. Two years later, the company is in flames, the pension plan is bleeding, the stock is worthless. What goes wrong in these cases? Usually it seems that top management made some incredibly stupid mistakes. But the people responsible are almost always remarkably intelligent and usually have terrific track records. Just as puzzling as the fact that brilliant managers can make bad mistakes is the way they so often magnify the damage. Once a company has made a serious mis-step, it often seems as though it can't do anything right. How does this happen? Instead of rectifying their mistakes, why do business leaders regularly make them worse? To answer these questions, Sydney Finkelstein has carried out the largest research project ever devoted to corporate mistakes and failures. In WHY SMART EXECUTIVES FAIL, he and his research team uncover-with startling clarity and unassailable documentation-the causes regularly responsible for major business breakdowns. He relates the stories of great business disasters and demonstrates that there are specific, identifiable ways in which many businesses regularly make themselves vulnerable to failure. The result is a truly indispensable, practical, must-read book that explains the mechanics of business failure, how to avoid them, and what to do if they happen. From the Trade Paperback edition.",
          "goodReadsBookId":"9136568",
          "image":"https://books.google.com/books/content?id=iv1_WsFlGGcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781101118238",
          "pageCount":336,
          "publicationDate":"2004-05-25",
          "publisher":"Penguin",
          "ratingCount":192,
          "title":"Why Smart Executives Fail"
       },
       {
          "author":"John Mullins",
          "averageRating":3.9,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 17:05:32",
          "description":"Starting your own business is a daunting task. No matter how talented you are, no matter how much capital you have, no matter how good your business plan is, if you’re pursuing a fundamentally flawed opportunity you’re heading for failure. So before spending time and money on a new enterprise it’s vital to know if your idea is actually going to work in practice. The New Business Road Test shows you how to avoid the obvious mistakes that everyone else makes. The new edition of this best-selling book features: • A new version of the 7 domains model. • Updated case studies that reflect the changes that have happened in the last four years. • Chapter 13 has been rewritten to make the Industry Analysis Checklist more understandable. • A new author run companion website for readers to access extra information.",
          "goodReadsBookId":"17027710",
          "image":"https://books.google.com/books/content?id=4yGMrbw4GboC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780273748908",
          "pageCount":336,
          "publicationDate":"2012-07-24",
          "publisher":"Pearson UK",
          "ratingCount":5146,
          "title":"The New Business Road Test"
       },
       {
          "author":"Neil Rackham",
          "averageRating":4.25,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 17:06:00",
          "description":"An Arsenal of Shrewd Tactics and Winning Strategies to Make You a Major Account Sales Success Knowing how to get to the decision maker, deal with the competition, understand buyer psychology, and service the client--these are the keys to success when you need to nail down major accounts. Now, for the first time, here's a book of practical, proven-effective strategies and tactics for the entire major account sales cycle. Based on Neil Rackham's exhaustive research, the strategies you'll find here will enable you to . . . Tailor your selling strategy to match each step in the client's decision-making process. Ensure that you won't lose your customers because you'll know the psychology of the buyer and how to respond to their doubts. Gain entry to accounts through many different windows of opportunity. Deal with competitive situations, take on bigger competitors, and win using strategies that the author's meticulous research shows are employed by the most successful salespeople. Handle negotiations, concessions on price, and term agreements skillfully and effectively. Offer the ongoing technical and maintenance support that keeps your major accounts yours. From a world-renowned sales innovator, this first-of-a-kind A-to-Z presentation of major account strategy puts sales success in your hands. Make it yours today. Read Major Account Sales Strategy.",
          "goodReadsBookId":"19214981",
          "image":"https://books.google.com/books/content?id=CFX3Zoj4SBMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780071708401",
          "pageCount":218,
          "publicationDate":"1989-01-22",
          "publisher":"McGraw Hill Professional",
          "ratingCount":227,
          "title":"Major Account Sales Strategy"
       },
       {
          "author":"Jack Welch",
          "averageRating":3.83,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-27 13:08:29",
          "description":"This enhanced digital edition features ten exclusive video commentaries from America's favorite CEO Jack Welch, who shares his trademark straight-talk advice and real-world management philosophy with readers at every level of an organization. Jack Welch knows how to win. During his forty-year career at General Electric, he led the company to year-after-year success around the globe, in multiple markets, against brutal competition. His honest, be-the-best style of management has become the gold standard in business, with his relentless focus on people, teamwork, and profits. Now regarded as the bible of business, Winning lays out the answers to the most difficult questions people face both on and off the job—from line workers to MBAs, from project managers to senior executives. Video commentary from Jack Welch expands on the book's treatment of the real \"stuff\" of work—the importance of positive energy in a leader, the proper role of HR within an organization, how to lead change effectively, why strategy doesn't have to be rocket science, the potential pitfalls of mergers and acquisitions, how to launch a new business within a big company, and more. The insights and solutions offered in the text, combined with lively video interviews with Welch, will change the way you work, lead, and succeed.",
          "goodReadsBookId":"18898276",
          "image":"https://books.google.com/books/content?id=rppL6KqqVpkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780062274014",
          "pageCount":384,
          "publicationDate":"2013-03-26",
          "publisher":"Harper Collins",
          "ratingCount":37633,
          "title":"Winning (Enhanced Edition)"
       },
       {
          "author":"John Walker Mullins",
          "averageRating":4.02,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-05-17 10:04:41",
          "description":"Unlock better opportunities with a new strategy for reinventing any business model. Succeeding with a new business whether in a corporation or a venture based setting requires taking a leap of faith. But in order to grow, the business will need to morph and adjust many times before it meets the needs of a viable market.Getting to Plan Bguides you through specific steps to effectively reinvent your entrepreneurial business model.",
          "goodReadsBookId":"6719158",
          "image":"https://books.google.com/books/content?id=EhiV9QphAIAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781422126691",
          "pageCount":249,
          "publicationDate":"2009-01-01",
          "publisher":"Harvard Business Press",
          "ratingCount":806,
          "title":"Getting to Plan B"
       },
       {
          "author":"Alistair Croll",
          "averageRating":4.13,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-05-20 20:23:04",
          "description":"Offers six sample business models and thirty case studies to help build and monetize a business.",
          "goodReadsBookId":"16033602",
          "image":"https://books.google.com/books/content?id=VJS5qQWOKUIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781449335670",
          "pageCount":409,
          "publicationDate":"2013-04-15",
          "publisher":"\"O'Reilly Media, Inc.\"",
          "ratingCount":5806,
          "title":"Lean Analytics"
       },
       {
          "author":"Dan Olsen",
          "averageRating":4.31,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-05-20 20:23:46",
          "description":"The missing manual on how to apply Lean Startup to build products that customers love The Lean Product Playbook is a practical guide to building products that customers love. Whether you work at a startup or a large, established company, we all know that building great products is hard. Most new products fail. This book helps improve your chances of building successful products through clear, step-by-step guidance and advice. The Lean Startup movement has contributed new and valuable ideas about product development and has generated lots of excitement. However, many companies have yet to successfully adopt Lean thinking. Despite their enthusiasm and familiarity with the high-level concepts, many teams run into challenges trying to adopt Lean because they feel like they lack specific guidance on what exactly they should be doing. If you are interested in Lean Startup principles and want to apply them to develop winning products, this book is for you. This book describes the Lean Product Process: a repeatable, easy-to-follow methodology for iterating your way to product-market fit. It walks you through how to: Determine your target customers Identify underserved customer needs Create a winning product strategy Decide on your Minimum Viable Product (MVP) Design your MVP prototype Test your MVP with customers Iterate rapidly to achieve product-market fit This book was written by entrepreneur and Lean product expert Dan Olsen whose experience spans product management, UX design, coding, analytics, and marketing across a variety of products. As a hands-on consultant, he refined and applied the advice in this book as he helped many companies improve their product process and build great products. His clients include Facebook, Box, Hightail, Epocrates, and Medallia. Entrepreneurs, executives, product managers, designers, developers, marketers, analysts and anyone who is passionate about building great products will find The Lean Product Playbook an indispensable, hands-on resource.",
          "goodReadsBookId":"23059700",
          "image":"https://books.google.com/books/content?id=dCOsBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781118960875",
          "pageCount":336,
          "publicationDate":"2015-06-02",
          "publisher":"John Wiley & Sons",
          "ratingCount":1335,
          "title":"The Lean Product Playbook"
       },
       {
          "author":"James P. Womack",
          "averageRating":0,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-05-22 17:36:07",
          "description":"Lean Thinking was launched in the fall of 1996, just in time for the recession of 1997. It told the story of how American, European, and Japanese firms applied a simple set of principles called 'lean thinking' to survive the recession of 1991 and grow steadily in sales and profits through 1996. Even though the recession of 1997 never happened, companies were starving for information on how to make themselves leaner and more efficient. Now we are dealing with the recession of 2001 and the financial meltdown of 2002. So what happened to the exemplar firms profiled in Lean Thinking? In the new fully revised edition of this bestselling book those pioneering lean thinkers are brought up to date. Authors James Womack and Daniel Jones offer new guidelines for lean thinking firms and bring their groundbreaking practices to a brand new generation of companies that are looking to stay one step ahead of the competition.",
          "goodReadsBookId":"",
          "image":"https://books.google.com/books/content?id=QZrZAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781471111006",
          "pageCount":400,
          "publicationDate":"2013-09-26",
          "publisher":"Simon and Schuster",
          "ratingCount":0,
          "title":"Lean Thinking"
       },
       {
          "author":"Matt LeMay",
          "averageRating":4.35,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-05-23 08:58:00",
          "description":"Product management has become a critical connective role for modern organizations, from small technology startups to global corporate enterprises. And yet the day-to-day work of product management remains largely misunderstood. In theory, product management is about building products that people love. The real-world practice of product management is often about difficult conversations, practical compromises, and hard-won incremental gains. In this book, author Matt LeMay focuses on the CORE connective skills-- communication, organization, research, execution--that can build a successful product management practice across industries, organizations, teams, andtoolsets. For current and aspiring product managers, this book explores:? On-the-ground tactics for facilitating collaboration and communication? How to talk to users and work with executives? The importance of setting clear and actionable goals? Using roadmaps to connect and align your team? A values-first approach to implementing Agile practices? Common behavioral traps that turn good product managers bad",
          "goodReadsBookId":"34691715",
          "image":"https://books.google.com/books/content?id=QaTTAQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781491982273",
          "pageCount":250,
          "publicationDate":"2017-11-25",
          "publisher":"",
          "ratingCount":285,
          "title":"Product Management in Practice"
       },
       {
          "author":"Steve Bockman",
          "averageRating":4.38,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-05-31 13:24:32",
          "description":"This business novel tells the story of Bud Sanders, a newly-hired manager at FiscalWare, as he strives to remove the uncertainties and confusion surrounding the project schedule for the company's latest product. Follow Bud as he discovers valuable tools and techniques for answering key questions: Is the project behind schedule? If so, by how much? Can anything be done to get it back on track?",
          "goodReadsBookId":"18339601",
          "image":"httpss://mobileappresources.s3.eu-north-1.amazonaws.com/BookReviewApp/cover_image.jpg",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781482048582",
          "pageCount":140,
          "publicationDate":"2013-02-14",
          "publisher":"",
          "ratingCount":8,
          "title":"Predictability"
       },
       {
          "author":"Tom DeMarco",
          "averageRating":4.17,
          "categories":[
             "Computers"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-05-31 13:25:42",
          "description":"Few books in computing have had as profound an influence on software management as Peopleware . The unique insight of this longtime best seller is that the major issues of software development are human, not technical. They’re not easy issues; but solve them, and you’ll maximize your chances of success. “Peopleware has long been one of my two favorite books on software engineering. Its underlying strength is its base of immense real experience, much of it quantified. Many, many varied projects have been reflected on and distilled; but what we are given is not just lifeless distillate, but vivid examples from which we share the authors’ inductions. Their premise is right: most software project problems are sociological, not technological. The insights on team jelling and work environment have changed my thinking and teaching. The third edition adds strength to strength.” — Frederick P. Brooks, Jr., Kenan Professor of Computer Science, University of North Carolina at Chapel Hill, Author of The Mythical Man-Month and The Design of Design “Peopleware is the one book that everyone who runs a software team needs to read and reread once a year. In the quarter century since the first edition appeared, it has become more important, not less, to think about the social and human issues in software develop¿ment. This is the only way we’re going to make more humane, productive workplaces. Buy it, read it, and keep a stock on hand in the office supply closet.” —Joel Spolsky, Co-founder, Stack Overflow “When a book about a field as volatile as software design and use extends to a third edition, you can be sure that the authors write of deep principle, of the fundamental causes for what we readers experience, and not of the surface that everyone recognizes. And to bring people, actual human beings, into the mix! How excellent. How rare. The authors have made this third edition, with its additions, entirely terrific.” —Lee Devin and Rob Austin, Co-authors of The Soul of Design and Artful Making For this third edition, the authors have added six new chapters and updated the text throughout, bringing it in line with today’s development environments and challenges. For example, the book now discusses pathologies of leadership that hadn’t previously been judged to be pathological; an evolving culture of meetings; hybrid teams made up of people from seemingly incompatible generations; and a growing awareness that some of our most common tools are more like anchors than propellers. Anyone who needs to manage a software project or software organization will find invaluable advice throughout the book.",
          "goodReadsBookId":"18224718",
          "image":"https://books.google.com/books/content?id=TVQUAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780133440737",
          "pageCount":272,
          "publicationDate":"2013-07-15",
          "publisher":"Addison-Wesley",
          "ratingCount":7884,
          "title":"Peopleware"
       },
       {
          "author":"Erin Meyer",
          "averageRating":4.36,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-05-31 13:30:50",
          "description":"An international business school professor discusses how to accept and understand diversity and work more effectively and sensitively with colleagues and counterparts from different countries with very different cultures in the new global marketplace. 15,000 first printing.",
          "goodReadsBookId":"18210794",
          "image":"https://books.google.com/books/content?id=IMsiBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781610392501",
          "pageCount":288,
          "publicationDate":"2014-05-27",
          "publisher":"PublicAffairs",
          "ratingCount":5579,
          "title":"The Culture Map"
       },
       {
          "author":"Alexander Osterwalder",
          "averageRating":4.82,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-05-31 13:31:24",
          "description":"The long-awaited follow-up to the international bestsellers, Business Model Generation and Value Proposition Design Alex Osterwalder and Yves Pigneurs’ Business Model Canvas changed the way the world creates and plans new business models. It has been used by corporations and startups and consultants around the world and is taught in hundreds of universities. After years of researching how the world’s best companies develop, test, and scale new business models, the authors have produced their definitive work. The Invincible Company explains what every organization can learn from the business models of the world’s most exciting companies. The book explains how companies such as Amazon, IKEA, Airbnb, Microsoft, and Logitech, have been able to create immensely successful businesses and disrupt entire industries. At the core of these successes are not just great products and services, but profitable, innovative business models--and the ability to improve existing business models while consistently launching new ones. The Invincible Company presents practical new tools for measuring, managing, and accelerating innovation, and strategies for reducing risk when launching new business models. Serving as a blueprint for your growth strategy, The Invincible Company explains how to constantly stay ahead of your competition. In-depth chapters explain how to create new growth engines, change how products and services are created and delivered, extract maximum profit from each type of business model, and much more. New tools—such as the Business Model Portfolio Map, Innovation Metrics, Innovation Strategy Framework, and the Culture Map—enable readers to understand how to design invincible companies. The Invincible Company: ● Helps large and small companies build their growth strategy and manage their core simultaneously ● Explains the world's best modern and historic business models ● Provides tools to assess your business model, innovation readiness, and all of your innovation projects Presented in striking 4-color, and packed with practical visuals and tools, The Invincible Company is a must-have book for business leaders, entrepreneurs, and innovation professionals.",
          "goodReadsBookId":"51132605",
          "image":"https://books.google.com/books/content?id=Ry7fDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781119523987",
          "pageCount":400,
          "publicationDate":"2020-04-06",
          "publisher":"John Wiley & Sons",
          "ratingCount":17,
          "title":"The Invincible Company"
       },
       {
          "author":"Mickey W. Mantle",
          "averageRating":3.83,
          "categories":[
             "Computers"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-05-31 13:32:16",
          "description":"This book has assembled a guide that will help you hire, motivate, and mentor a software development team that functions at the highest level. Their rules of thumb and coaching advice form a great blueprint for new and experienced software engineering managers alike. All too often, software development is deemed unmanageable. The news is filled with stories of projects that have run catastrophically over schedule and budget.",
          "goodReadsBookId":"13705479",
          "image":"https://books.google.com/books/content?id=MDkFCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780321822031",
          "pageCount":422,
          "publicationDate":"2012",
          "publisher":"Pearson Education",
          "ratingCount":259,
          "title":"Managing the Unmanageable"
       },
       {
          "author":"Hermann Simon",
          "averageRating":0,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-06-26 09:15:21",
          "description":"The world’s foremost expert on pricing strategy shows how this mysterious process works and how to maximize value through pricing to company and customer. In all walks of life, we constantly make decisions about whether something is worth our money or our time, or try to convince others to part with their money or their time. Price is the place where value and money meet. From the global release of the latest electronic gadget to the bewildering gyrations of oil futures to markdowns at the bargain store, price is the most powerful and pervasive economic force in our day-to-day lives and one of the least understood. The recipe for successful pricing often sounds like an exotic cocktail, with equal parts psychology, economics, strategy, tools and incentives stirred up together, usually with just enough math to sour the taste. That leads managers to water down the drink with hunches and rules of thumb, or leave out the parts with which they don’t feel comfortable. While this makes for a sweeter drink, it often lacks the punch to have an impact on the customer or on the business. It doesn’t have to be that way, though, as Hermann Simon illustrates through dozens of stories collected over four decades in the trenches and behind the scenes. A world-renowned speaker on pricing and a trusted advisor to Fortune 500 executives, Simon’s lifelong journey has taken him from rural farmers’ markets, to a distinguished academic career, to a long second career as a n entrepreneur and management consultant to companies large and small throughout the world. Along the way, he has learned from Nobel Prize winners and leading management gurus, and helped countless managers and executives use pricing as a way to create new markets, grow their businesses and gain a sustained competitive advantage. He also learned some tough personal lessons about value, how people perceive it, and how people profit from it. In this engaging and practical narrative, Simon leaves nothing out of the pricing cocktail, but still makes it go down smoothly and leaves you wanting to learn more and do more—as a consumer or as a business person. You will never look at pricing the same way again.",
          "goodReadsBookId":"",
          "image":"https://books.google.com/books/content?id=4eDHCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9783319204000",
          "pageCount":221,
          "publicationDate":"2015-10-20",
          "publisher":"Springer",
          "ratingCount":0,
          "title":"Confessions of the Pricing Man"
       },
       {
          "author":"Chris Guillebeau",
          "averageRating":3.85,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-06-29 21:08:26",
          "description":"Shares advice for transitioning away from unfulfilling jobs to embark on adventurous, meaningful careers, outlining recommendations for starting a personal business with a minimum of time and investment while turning ideas into higher income levels. 60,000 first printing.",
          "goodReadsBookId":"12605157",
          "image":"https://books.google.com/books/content?id=2YeBy-RlgkQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780307951526",
          "pageCount":285,
          "publicationDate":"2012",
          "publisher":"Broadway Business",
          "ratingCount":49458,
          "title":"The $100 Startup"
       },
       {
          "author":"Chris Guillebeau",
          "averageRating":3.76,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-07-03 21:01:20",
          "description":"The author of the New York Times Bestseller THE $100 STARTUP, shows how to launch a profitable side hustle in just 27 days. To some, the idea of quitting their day job to start a business is exhilarating. For others, it’s terrifying. After all, a job that produces a steady paycheck can be difficult to give up. But in a time when businesses have so little loyalty to employees that the very notion of “job security” has become a punchline, wouldn’t it be great to have an additional source of income to fall back on? And wouldn’t it be great to make that happen without leaving your day job? Enter the Side Hustle. Based on detailed information from hundreds of case studies, Chris Guillebeau provides a step-by-step guide that anyone can use to create and launch a profitable project in less than a month. Designed for the busy and impatient, this plan will have you generating income immediately, without the risk of throwing yourself head first into the world of entrepreneurship. Whether you just want to make some extra money, or start something that may end up replacing your day job entirely, the side hustle is the new job security. When you generate income from multiple sources, it gives you options, and in today’s world, options aren't just nice to have: they're essential. You don’t need entrepreneurial experience to launch a profitable side hustle. You don’t need a business degree, know how to code, or be an expert marketer. And you certainly don’t need employees or investors. With this book as your guide, anyone can learn to build a fast track to freedom.",
          "goodReadsBookId":"36874212",
          "image":"https://books.google.com/books/content?id=YZi-DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":true,
          "isLent":false,
          "isRead":true,
          "isbn":"9781524758851",
          "pageCount":272,
          "publicationDate":"2017-09-19",
          "publisher":"Currency",
          "ratingCount":2689,
          "title":"Side Hustle"
       },
       {
          "author":"Brian Tracy",
          "averageRating":3.75,
          "categories":[
             "Self-Help"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-07-23 12:03:37",
          "description":"",
          "goodReadsBookId":"2405918",
          "image":"https://books.google.com/books/content?id=udaqPQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781931059343",
          "pageCount":191,
          "publicationDate":"2009-01-01",
          "publisher":"Taller Del Exito",
          "ratingCount":206,
          "title":"21 Leyes Absolutamente Inquebrantables del Dinero"
       },
       {
          "author":"Donald G. Reinertsen",
          "averageRating":4.17,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-07-24 21:47:11",
          "description":"This is the first book that comprehensively describes the underlying principles that create flow in product development processes. It covers 175 principles organized into eight major areas. It is of interest to managers and technical professionals responsible for product development processes.",
          "goodReadsBookId":"6278270",
          "image":"https://books.google.com/books/content?id=1HlPPgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781935401001",
          "pageCount":294,
          "publicationDate":"2009",
          "publisher":"Celeritas Pub",
          "ratingCount":2205,
          "title":"The Principles of Product Development Flow"
       },
       {
          "author":"Geoffrey A. Moore",
          "averageRating":3.97,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-08-18 20:12:58",
          "description":"\"The chasm is where high-tech fortunes are lost... the tornado is where they are made.\"-- Steve Jobs, Founder & CEO, Next Computer, Inc. Now, in this fascinating sequel, Moore shows how to capitalize on the profit-rich niches and hyper-growth markets beyond the chasm. Continuing to chart the impact of the Technology Adoption Life Cycle, he explores its effects not just on marketing but on overall business planning, especially strategic partnerships, competitive advantage, positioning and organizational leadership. Moore's most startling lesson is: \"As markets move from stage to stage in the Life Cycle, the winning strategy does not just change -- it actually reverses the prior strategy. The very skills that you've just perfected become your biggest liabilities; and if you can't put them aside to acquire new ones, then you're in for tough times.\" As challenging as this lesson is to apply, Moore leads the way. Using actual examples of cutting-edge firms, he applies the Life Cycle model to all aspects of managing a market-focused business strategy, including how to manage people effectively through each phase of the cycle. There are significant management implications: Chasm-crossers who love the customer intimacy of niches may rebel against the depersonalizing power of the tornado; tornado managers who relish the gales of hyper-growth may resist the inevitable return to the niche, in the guise of mass customization, once the rush to the new paradigm subsides. All industries relying on technology -- not just computer hardware, software and telecommunications, but entertainment, publishing, broadcasting, banking, insurance, health care, aerospace, defense, utilities, pharmaceuticals and retail -- must master Moore's lessons to see the year 2000. If you are marketing technology-based products or managing the people who do, then you will find yourself Inside the Tornado.",
          "goodReadsBookId":"921123",
          "image":"https://books.google.com/books/content?id=g-kFtmlcJ5sC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780887307652",
          "pageCount":256,
          "publicationDate":"1995-10-05",
          "publisher":"HarperBusiness",
          "ratingCount":1252,
          "title":"Inside the Tornado"
       },
       {
          "author":"Fred Vogelstein",
          "averageRating":3.76,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-08-25 21:18:26",
          "description":"Behind the bitter rivalry between Apple and Google—and how it's reshaping the way we think about technology The rise of smartphones and tablets has altered the industry of making computers. At the center of this change are Apple and Google, two companies whose philosophies, leaders, and commercial acumen have steamrolled the competition. In the age of Android and the iPad, these corporations are locked in a feud that will play out not just in the mobile marketplace but in the courts and on screens around the world. Fred Vogelstein has reported on this rivalry for more than a decade and has rare access to its major players. In Dogfight, he takes us into the offices and board rooms where company dogma translates into ruthless business; behind outsize personalities like Steve Jobs, Apple's now-lionized CEO, and Eric Schmidt, Google's executive chairman; and inside the deals, lawsuits, and allegations that mold the way we communicate. Apple and Google are poaching each other's employees. They bid up the price of each other's acquisitions for spite, and they forge alliances with major players like Facebook and Microsoft in pursuit of market dominance. Dogfight reads like a novel: vivid nonfiction with never-before-heard details. This is more than a story about what devices will replace our cell phones and laptops. It's about who will control the content on those devices and where that content will come from—about the future of media and the Internet in Silicon Valley, New York, and Hollywood.",
          "goodReadsBookId":"17405098",
          "image":"https://books.google.com/books/content?id=qDOdHNAb3aMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780374711009",
          "pageCount":272,
          "publicationDate":"2013-11-12",
          "publisher":"Sarah Crichton Books",
          "ratingCount":2161,
          "title":"Dogfight: How Apple and Google Went to War and Started a Revolution"
       },
       {
          "author":"Tomas Chamorro-Premuzic",
          "averageRating":3.88,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-09-05 10:18:31",
          "description":"Why is it so easy for incompetent men to become leaders? Most organizations equate leadership potential with a handful of destructive personality traits, like overconfidence and narcissism. The result is a system that rewards arrogance rather than humility, and loudness rather than wisdom. There is new system and process that helps us put the right people in charge.",
          "goodReadsBookId":"48582088",
          "image":"https://books.google.com/books/content?id=1TxFyQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9788416997244",
          "pageCount":224,
          "publicationDate":"2020-03-30",
          "publisher":"Urano",
          "ratingCount":437,
          "title":"Por Que Tantos Hombres Incompetentes Se Convierten En Lideres?"
       },
       {
          "author":"Michael Masterson",
          "averageRating":3.92,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-09-08 17:43:42",
          "description":"In Seven Years to Seven Figures, self-made millionaire and renowned wealth coach Michael Masterson reveals the steps you can take to accumulate seven-figure wealth within seven years—or less. Seven Years to Seven Figures will give you the tools to increase your income, get the highest possible returns on investments, save wisely—and secure your financial future faster than you may have ever dreamed.",
          "goodReadsBookId":"16474348",
          "image":"https://books.google.com/books/content?id=np0tHhYWYyMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781118429242",
          "pageCount":247,
          "publicationDate":"2012-06-19",
          "publisher":"John Wiley & Sons",
          "ratingCount":397,
          "title":"Seven Years to Seven Figures"
       },
       {
          "author":"John Doerr",
          "averageRating":4.02,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2021-01-05 20:31:53",
          "description":"#1 New York Times Bestseller Legendary venture capitalist John Doerr reveals how the goal-setting system of Objectives and Key Results (OKRs) has helped tech giants from Intel to Google achieve explosive growth—and how it can help any organization thrive. In the fall of 1999, John Doerr met with the founders of a start-up whom he'd just given $12.5 million, the biggest investment of his career. Larry Page and Sergey Brin had amazing technology, entrepreneurial energy, and sky-high ambitions, but no real business plan. For Google to change the world (or even to survive), Page and Brin had to learn how to make tough choices on priorities while keeping their team on track. They'd have to know when to pull the plug on losing propositions, to fail fast. And they needed timely, relevant data to track their progress—to measure what mattered. Doerr taught them about a proven approach to operating excellence: Objectives and Key Results. He had first discovered OKRs in the 1970s as an engineer at Intel, where the legendary Andy Grove (\"the greatest manager of his or any era\") drove the best-run company Doerr had ever seen. Later, as a venture capitalist, Doerr shared Grove's brainchild with more than fifty companies. Wherever the process was faithfully practiced, it worked. In this goal-setting system, objectives define what we seek to achieve; key results are how those top-priority goals will be attained with specific, measurable actions within a set time frame. Everyone's goals, from entry level to CEO, are transparent to the entire organization. The benefits are profound. OKRs surface an organization's most important work. They focus effort and foster coordination. They keep employees on track. They link objectives across silos to unify and strengthen the entire company. Along the way, OKRs enhance workplace satisfaction and boost retention. In Measure What Matters, Doerr shares a broad range of first-person, behind-the-scenes case studies, with narrators including Bono and Bill Gates, to demonstrate the focus, agility, and explosive growth that OKRs have spurred at so many great organizations. This book will help a new generation of leaders capture the same magic.",
          "goodReadsBookId":"40543231",
          "image":"https://books.google.com/books/content?id=u2NDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":true,
          "isLent":false,
          "isRead":true,
          "isbn":"9780525536239",
          "pageCount":320,
          "publicationDate":"2018-04-24",
          "publisher":"Penguin",
          "ratingCount":16543,
          "title":"Measure What Matters"
       },
       {
          "author":"Josh Lannon",
          "averageRating":3.8,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2021-02-13 17:03:26",
          "description":"Social Entrepreneur is a book about how two ordinary people turn a huge social problem into a solution, not only for themselves but for thousands of others. From Nightclub Owner (Josh) and Law Enforcement Officer (Lisa) to Social Entrepreneurs of Journey Healing Centers (accredited private drug and alcohol treatment centers). They turned their lives around and are building businesses that bring families back together again (by using the Rich Dad principles). Businesses are evolving to a higher purpose, the why we do what we do. Like the movements across the world and in our own backyards (occupy wall street) people want purpose in their lives. They want to be a positive contribution. We are in the next Mega Trend of a social movement.",
          "goodReadsBookId":"19093629",
          "image":"https://books.google.com/books/content?id=RbeaAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781937832438",
          "pageCount":220,
          "publicationDate":"2013-02-28",
          "publisher":"RDA Press, LLC",
          "ratingCount":15,
          "title":"The Social Capitalist"
       },
       {
          "author":"Richard Duncan",
          "averageRating":3.81,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2021-04-25 20:14:37",
          "description":"In this updated, second edition of the highly acclaimed international best seller, The Dollar Crisis: Causes, Consequences, Cures, Richard Duncan describes the flaws in the international monetary system that have destabilized the global economy and that may soon culminate in a deflation-induced worldwide economic slump. The Dollar Crisis is divided into five parts: Part One describes how the US trade deficits, which now exceed US$1 million a minute, have destabilized the global economy by creating a worldwide credit bubble. Part Two explains why these giant deficits cannot persist and why a US recession and a collapse in the value of the Dollar are unavoidable. Part Three analyzes the extraordinarily harmful impact that the US recession and the collapse of the Dollar will have on the rest of the world. Part Four offers original recommendations that, if implemented, would help mitigate the damage of the coming worldwide downturn and put in place the foundations for balanced and sustainable economic growth in the decades ahead. Part Five, which has been newly added to the second edition, describes the extraordinary evolution of this crisis since the first edition was completed in September 2002. It also considers how the Dollar Crisis is likely to unfold over the years immediately ahead, the likely policy response to the crisis, and why that response cannot succeed. The Dollar Standard is inherently flawed and increasingly unstable. Its collapse will be the most important economic event of the 21st Century.",
          "goodReadsBookId":"16346065",
          "image":"https://books.google.com/books/content?id=RqU9IIPKjhcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781118177075",
          "pageCount":224,
          "publicationDate":"2011-10-31",
          "publisher":"John Wiley & Sons",
          "ratingCount":186,
          "title":"The Dollar Crisis"
       },
       {
          "author":"Robert G. Allen",
          "averageRating":4.05,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2022-10-13 09:15:44",
          "description":"In Multiple Streams of Income, bestselling author Robert Allen presents ten revolutionary new methods for generating over $100,000 a year—on a part-time basis, working from your home, using little or none of your own money. For this book, Allen researched hundreds of income-producing opportunities and narrowed them down to ten surefire moneymakers anyone can profit from. This revised edition includes a new chapter on a cutting-edge investing technique.",
          "goodReadsBookId":"10538004",
          "image":"https://books.google.com/books/content?id=bTYQBzpVNgQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9781118046128",
          "pageCount":338,
          "publicationDate":"2011-01-19",
          "publisher":"John Wiley & Sons",
          "ratingCount":5222,
          "title":"Multiple Streams of Income"
       },
       {
          "author":"Myka Meier",
          "averageRating":3.98,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"dddbf169-6c1d-4b83-84f9-d2689e6ceff8",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2022-10-13 09:20:05",
          "description":"The founder of The Plaza Hotel’s Finishing Program, “the picture of grace,” spills her insider tips on how to achieve an upper edge in your career (Vogue). Etiquette expert Myka Meier has coached thousands of business professionals and worked with internal human resources and hiring departments of some of the most successful Fortune 100 companies to learn what it takes to be the best in business. It may surprise you to learn that etiquette is what differentiates you from everyone else, and Business Etiquette Made Easy shows you how to put your best professional foot forward. Whether you’re just entering the workforce or have been working for many years and want to revamp your image, Myka shares practical tips that are simple to incorporate into your everyday business life. Through easy-to-follow chapters, you’ll learn how to: Master resumes and interviews at any level Dress like a polished professional Make a great first impression Network like a pro Have superb business dining table manners And much, much more! Perfect for a recent college graduate as well as those looking to climb the ladder in their respective jobs or industries, Business Etiquette Made Easy is an essential read for any working professional. Praise for Myka Meier “Meier isn’t your grandmother’s etiquette teacher.” —Elle Decor “America’s queen of good manners.” —The Times Magazine “One of the most flawlessly presented and impeccably mannered women.” —New York Post “The Queen of Etiquette.” —Daily Mail",
          "goodReadsBookId":"52770082",
          "image":"https://books.google.com/books/content?id=82W2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9781510751965",
          "pageCount":160,
          "publicationDate":"2020-05-05",
          "publisher":"Simon and Schuster",
          "ratingCount":101,
          "title":"Business Etiquette Made Easy"
       },
       {
          "author":"Robert A. Glover",
          "averageRating":4.05,
          "categories":[
             "Family & Relationships"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:47:48",
          "description":"Debunks the \"nice guy syndrome,\" the need to please others at one's own expense with the hope of receiving happiness, love, and fulfillment, and offers advice for how to rediscover oneself, revive one's sex life, and build better relationships with others.",
          "goodReadsBookId":"97642",
          "image":"https://books.google.com/books/content?id=qWkHAAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9780762415335",
          "pageCount":180,
          "publicationDate":"2002-12-18",
          "publisher":"Running PressBook Pub",
          "ratingCount":9590,
          "title":"No More Mr. Nice Guy!"
       },
       {
          "author":"Esther Vilar",
          "averageRating":3.6,
          "categories":[
             "Social Science"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 15:44:02",
          "description":"This text explores the relationship between the sexes. Esther Vilar maintains that a man is a human being who works, while a woman chooses to become a prostitute, letting a man provide for her and her children in return for carefully dispensed praise and sex.",
          "goodReadsBookId":"1973951",
          "image":"https://books.google.com/books/content?id=zXXrAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780953096428",
          "pageCount":154,
          "publicationDate":"2005-05-09",
          "publisher":"Pinter & Martin Publishers",
          "ratingCount":1160,
          "title":"The Manipulated Man"
       },
       {
          "author":"Tim Clinton",
          "averageRating":4.23,
          "categories":[
             "Self-Help"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 15:46:42",
          "description":"The answer to why people feel and act the way they do lies in the profound effect of a child's bonding process with his or her parents. How successfully we form and maintain relationships throughout life is related to those early issues of \"attachment.\" The author has cited four primary bonding styles that explain why people love, feel, and act the way they do. This book is for anyone who desires closeness, especially in the most intimate relationships: marriage, parenting, close friends, and ultimately with God.",
          "goodReadsBookId":"10122600",
          "image":"https://books.google.com/books/content?id=WLbfg-nhXkYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781418568696",
          "pageCount":316,
          "publicationDate":"2009-02-15",
          "publisher":"Thomas Nelson",
          "ratingCount":325,
          "title":"Attachments"
       },
       {
          "author":"Robert Duff",
          "averageRating":3.98,
          "categories":[
             "Anxiety"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 15:47:39",
          "description":"This book about dealing with anxiety is written in a conversational way that includes swearing.",
          "goodReadsBookId":"26186839",
          "image":"https://books.google.com/books/content?id=l6EdswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781514866009",
          "pageCount":70,
          "publicationDate":"2015-07-07",
          "publisher":"Createspace Independent Publishing Platform",
          "ratingCount":2246,
          "title":"Hardcore Self Help"
       },
       {
          "author":"Melody Beattie",
          "averageRating":4.44,
          "categories":[
             "Self-Help"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 15:48:40",
          "description":"Written for those of us who struggle with codependency, these daily meditations offer growth and renewal, and remind us that the best thing we can do is take responsibility for our own self-care. Melody Beattie integrates her own life experiences and fundamental recovery reflections in this unique daily meditation book written especially for those of us who struggle with the issue of codependency.Problems are made to be solved, Melody reminds us, and the best thing we can do is take responsibility for our own pain and self-care. In this daily inspirational book, Melody provides us with a thought to guide us through the day and she encourages us to remember that each day is an opportunity for growth and renewal.",
          "goodReadsBookId":"7627736",
          "image":"https://books.google.com/books/content?id=awjXDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781592857975",
          "pageCount":408,
          "publicationDate":"2009-12-12",
          "publisher":"Simon and Schuster",
          "ratingCount":5551,
          "title":"The Language of Letting Go"
       },
       {
          "author":"Craig English",
          "averageRating":3.84,
          "categories":[
             "Self-Help"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 15:49:49",
          "description":"Do you (or does someone you know)... --Apologize frequently or for things you are not responsible for? --Get preoccupied with what other people think of you? --Become unhappy when your partner isn't happy? --Feel worried or fretful so often it seems normal? --Often not know what you want? --Constantly second-guess yourself? Chronic Niceness affects multitudes, causing severe anxiety and depression, crippling self-esteem, and undermining and destroying relationships Anxious to Please reveals the primary psychological cause of Chronic Niceness--Anxious Attachment. Anxious Attachment drives the Nice Person to accommodate, acquiesce and avoid conflict. Nice People take what they're given rather than asking for what they want, often sacrificing relationship, careers and their own integrity. Anxious to Please presents seven powerful practices designed to bring about: resilient self-esteem; a happier and calmer emotional life; a reality-based optimism for the future; fulfilling sex; and satisfying relationships.",
          "goodReadsBookId":"10165699",
          "image":"https://books.google.com/books/content?id=trRxPGOa2gwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781402231759",
          "pageCount":240,
          "publicationDate":"2006-04-01",
          "publisher":"Sourcebooks, Inc.",
          "ratingCount":346,
          "title":"Anxious to Please"
       },
       {
          "author":"Richard Dawkins",
          "averageRating":4.14,
          "categories":[
             "Literary Criticism"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 15:50:54",
          "description":"An ethologist shows man to be a gene machine whose world is one of savage competition and deceit",
          "goodReadsBookId":"315240",
          "image":"https://books.google.com/books/content?id=WkHO9HI7koEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780192860927",
          "pageCount":352,
          "publicationDate":"1989",
          "publisher":"Oxford University Press, USA",
          "ratingCount":130977,
          "title":"The Selfish Gene"
       },
       {
          "author":"Karen Casey",
          "averageRating":3.99,
          "categories":[
             "Body, Mind & Spirit"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:04:33",
          "description":"The bestselling author of Each Day a New Beginning offers a practical, easy-to-implement guide to making positive changes—and living the results. Thirty years ago, Karen Casey wandered into a support group and learned there was only one thing she could change: herself! She found a group of people who had adopted this concept, and she joined them. The resulting transformation was so profound that Casey dedicated herself to teaching others what’s possible when we put our minds to changing our lives. Change Your Mind and Your Life Will Follow offers a dozen simple principles to live by. Each principle is explored in its own chapter and includes meditation-style essays to help readers access peaceful, life-changing responses to just about any situation. Finding happiness, peace, and purpose really can be as simple as changing our minds. This little book will show you how. “Change Your Mind and Your Life Will Follow tells the truth and tells it well. I recommend it.” —Marianne Williamson",
          "goodReadsBookId":"10145714",
          "image":"https://books.google.com/books/content?id=YCC3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781609250089",
          "pageCount":128,
          "publicationDate":"2016-04-01",
          "publisher":"Mango Media Inc.",
          "ratingCount":292,
          "title":"Change Your Mind and Your Life Will Follow"
       },
       {
          "author":"Alex Lickerman",
          "averageRating":3.99,
          "categories":[
             "Body, Mind & Spirit"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:06:37",
          "description":"Legions of self-help authors rightly urge personal development as the key to happiness, but they typically fail to focus on its most important objective: hardiness. Though that which doesn't kill us can make us stronger, as Nietzsche tells us, few authors today offer any insight into just how to springboard from adversity to strength. It doesn't just happen automatically, and it takes practice. New scientific research suggests that resilience isn't something with which only a fortunate few of us have been born, but rather something we can all take specific action to develop. To build strength out of adversity, we need a catalyst. What we need, according to Dr. Alex Lickerman, is wisdom—wisdom that adversity has the potential to teach us. Lickerman's underlying premise is that our ability to control what happens to us in life may be limited, but we have the ability to establish a life-state to surmount the suffering life brings us. The Undefeated Mind distills the wisdom we need to create true resilience into nine core principles, including: --A new definition of victory and its relevance to happiness --The concept of the changing of poison into medicine --A way to view prayer as a vow we make to ourselves. --A method of setting expectations that enhances our ability to endure disappointment and minimizes the likelihood of quitting --An approach to taking personal responsibility and moral action that enhances resilience --A process to managing pain—both physical and emotional—that enables us to push through obstacles that might otherwise prevent us from attaining out goals --A method of leveraging our relationships with others that helps us manifest our strongest selves Through stories of patients who have used these principles to overcome suffering caused by unemployment, unwanted weight gain, addiction, rejection, chronic pain, retirement, illness, loss, and even death, Dr. Lickerman shows how we too can make these principles function within our own lives, enabling us to develop for ourselves the resilience we need to achieve indestructible happiness. At its core, The Undefeated Mind urges us to stop hoping for easy lives and focus instead on cultivating the inner strength we need to enjoy the difficult lives we all have.",
          "goodReadsBookId":"13767046",
          "image":"https://books.google.com/books/content?id=fYKjAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780757316425",
          "pageCount":278,
          "publicationDate":"2012-11-06",
          "publisher":"Health Communications, Inc.",
          "ratingCount":856,
          "title":"The Undefeated Mind"
       },
       {
          "author":"David Shenk",
          "averageRating":3.86,
          "categories":[
             "Psychology"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:09:03",
          "description":"Is true greatness obtainable from everyday means and everyday genes? Conventional wisdom says no, that a lucky few are simply born with certain gifts. The new science of human potential suggests otherwise. Forget everything you think you know about genes, talent, and intelligence, and take a look at the amazing new evidence. Here, interweaving cutting-edge research from numerous scientific fields, David Shenk offers a new view of human potential, giving readers more of a sense of ownership over their accomplishments, and freeing parents from the bonds of genetic determinism. As Shenk points out, our genes are not a “blueprint” that dictate individual destinies. Rather we are all the product of interplay between genes and outside stimuli—a dynamic that we can influence. It is a revolutionary and life-changing message.",
          "goodReadsBookId":"7848950",
          "image":"https://books.google.com/books/content?id=gZVaXvKwxHIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780385532655",
          "pageCount":288,
          "publicationDate":"2010-03-09",
          "publisher":"Anchor",
          "ratingCount":1937,
          "title":"The Genius in All of Us"
       },
       {
          "author":"Richard H. Thaler",
          "averageRating":4.18,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:34:37",
          "description":"Winner of the Nobel Prize in Economics Get ready to change the way you think about economics. Nobel laureate Richard H. Thaler has spent his career studying the radical notion that the central agents in the economy are humans—predictable, error-prone individuals. Misbehaving is his arresting, frequently hilarious account of the struggle to bring an academic discipline back down to earth—and change the way we think about economics, ourselves, and our world. Traditional economics assumes rational actors. Early in his research, Thaler realized these Spock-like automatons were nothing like real people. Whether buying a clock radio, selling basketball tickets, or applying for a mortgage, we all succumb to biases and make decisions that deviate from the standards of rationality assumed by economists. In other words, we misbehave. More importantly, our misbehavior has serious consequences. Dismissed at first by economists as an amusing sideshow, the study of human miscalculations and their effects on markets now drives efforts to make better decisions in our lives, our businesses, and our governments. Coupling recent discoveries in human psychology with a practical understanding of incentives and market behavior, Thaler enlightens readers about how to make smarter decisions in an increasingly mystifying world. He reveals how behavioral economic analysis opens up new ways to look at everything from household finance to assigning faculty offices in a new building, to TV game shows, the NFL draft, and businesses like Uber. Laced with antic stories of Thaler’s spirited battles with the bastions of traditional economic thinking, Misbehaving is a singular look into profound human foibles. When economics meets psychology, the implications for individuals, managers, and policy makers are both profound and entertaining. Shortlisted for the Financial Times & McKinsey Business Book of the Year Award",
          "goodReadsBookId":"25621081",
          "image":"https://books.google.com/books/content?id=xQedBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780393246773",
          "pageCount":432,
          "publicationDate":"2015-05-11",
          "publisher":"W. W. Norton & Company",
          "ratingCount":12673,
          "title":"Misbehaving: The Making of Behavioral Economics"
       },
       {
          "author":"Alan W. Watts",
          "averageRating":4.24,
          "categories":[
             "Self-Help"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:39:48",
          "description":"We live in an age of unprecedented anxiety. Spending all our time trying to anticipate and plan for the future and to lamenting the past, we forget to embrace the here and now. We are so concerned with tomorrow that we forget to enjoy today. Drawing from Eastern philosophy and religion, Alan Watts shows that it is only by acknowledging what we do not—and cannot—know that we can learn anything truly worth knowing. In The Wisdom of Insecurity, he shows us how, in order to lead a fulfilling life, we must embrace the present—and live fully in the now. Featuring an Introduction by Deepak Chopra.",
          "goodReadsBookId":"13531222",
          "image":"https://books.google.com/books/content?id=lg6HCFEvx-UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780307809865",
          "pageCount":160,
          "publicationDate":"2011-11-16",
          "publisher":"Vintage",
          "ratingCount":12638,
          "title":"The Wisdom of Insecurity"
       },
       {
          "author":"Pema Chodron",
          "averageRating":4.33,
          "categories":[
             "Religion"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:59:38",
          "description":"Inspired by the Buddhist tradition of the 108-day retreat, a Tibetan Buddhist nun offers instruction and meditations for achieving compassion and awareness in everyday living.",
          "goodReadsBookId":"740875",
          "image":"https://books.google.com/books/content?id=BvVzYXmrGtIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781590305553",
          "pageCount":224,
          "publicationDate":"2008",
          "publisher":"Shambhala Publications",
          "ratingCount":4673,
          "title":"Comfortable with Uncertainty"
       },
       {
          "author":"Jeff Boss",
          "averageRating":3.75,
          "categories":[
             
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 17:00:19",
          "description":"In this concise guide to building mental toughness, executive coach and former Navy SEAL Jeff Boss teaches a blend of unique mental training methodologies he used to perform optimally in the most adverse conditions. This is a how-to manual for enhancing your self-belief, self-confidence, and mental toughness as a means of reaching new levels of success no matter your profession. Jeff's unique WYSIWYG (what you see is what you get) style of writing makes the science of mental toughness easy to read and relatable. He shares personal stories of how he used these mental frameworks to endure BUD/S (Navy SEAL Training) and other unfathomable challenges. With a client list that ranges from high potentials to top executives, Jeff demonstrates how to pave the way for breakthrough potential by sharing over 22 mental exercises for dealing with overwhelm. This Kindle book is powerful-but only to the degree that you-the reader-are willing to proactively put forth the focus to be the person you want to be. Managing the Mental Game will is PACKED with practical exercises you won't find anywhere else. For the price of two cups of coffee, you'll learn exactly what it takes to build the mental fortitude you need to adapt to change. Specifically, you'll learn: 1. Why understanding the mind is the smartest thing you can do 2. Learn the 4 Mental Traps and How To Avoid Them 3. The 3 types of focus and why mastering them is fundamental to success 4. Learn how to deal with uncertainty and not by stymied by fear 5. Learn the 3 pitfalls of uncertainty so you can anticipate and avoid them 6. The truth about managing uncertainty 7. Learn the neuroscience of change 8. Become proficient in replacing negative thoughts with positive ones 9. Create more productive thinking habits by understanding thought architecture 10. 22 exercises for dealing with overwhelming pressure 11. Learn the most effective path to building mental fortitude The lessons and techniques presented in this book are essential reading for anyone seeking greater success and peak performance, whether it be on the playing field, in business, or life in general. Whatever your personal endeavor may be, whatever challenge you may be facing; these lessons will prepare you to move forward and to excel in a powerful way. Reach new levels of personal success and performance as you learn, practice, and apply these powerful concepts and proven techniques.",
          "goodReadsBookId":"29454085",
          "image":"https://books.google.com/books/content?id=oUyNjwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780990670339",
          "pageCount":158,
          "publicationDate":"2015-12-26",
          "publisher":"",
          "ratingCount":81,
          "title":"Managing the Mental Game"
       },
       {
          "author":"Jonathan Fields",
          "averageRating":3.85,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 17:00:44",
          "description":"Jonathan Fields knows the risks-and potential power-of uncertainty. He gave up a six-figure income as a lawyer to make $12 an hour as a personal trainer. Then, married with a 3-month old baby, he signed a lease to launch a yoga center in the heart of New York City. . . the day before 9/11. But he survived, and along the way he developed a fresh approach to transforming uncertainty, risk of loss, and exposure to judgment into catalysts for innovation, creation, and achievement. Properly understood and harnessed, fear and uncertainty can become fuel for creative genius rather than sources of pain, anxiety, and suffering. In business, art, and life, creating on a world-class level demands bold action and leaps of faith in the face of great uncertainty. But that uncertainty can lead to fear, anxiety, paralysis, and destruction. It can gut creativity and stifle innovation. It can keep you from taking the risks necessary to do great work and craft a deeply-rewarding life. And it can bring companies that rely on innovation grinding to a halt. That is, unless you know how to use it to your advantage. Fields draws on leading-edge technology, cognitive-science and ancient awareness-focusing techniques in a fresh, practical, non-dogmatic way. His approach enables creativity and productivity on an entirely different level and can turn the once-tortuous journey into a more enjoyable quest. Fields will reveal how to: Make changes to your workflow that unlock buried creative potential. Build \"creation hives\" -- supportive groups that can supercharge and humanize the process. Tap social technology and user co-creation to add clarity, certainty, and sanity, even if you're an artist or solo-creator. Develop a set of personal practices and mindset shifts that let you not just tolerate, but invite and even amplify, uncertainty as a catalyst for genius. Drawing on extensive case studies and research, Fields shares a set of detailed personal practices and environmental changes that can not only humanize the creative process, but also allow individuals and teams to stay more open to opportunity and play a bigger creative game.",
          "goodReadsBookId":"12058270",
          "image":"https://books.google.com/books/content?id=-wu_hh7M1xMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781101544532",
          "pageCount":240,
          "publicationDate":"2011-09-29",
          "publisher":"Penguin",
          "ratingCount":1940,
          "title":"Uncertainty"
       },
       {
          "author":"Susan J. Jeffers",
          "averageRating":4.03,
          "categories":[
             "Assertiveness (Psychology)"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 17:01:14",
          "description":"Everyone experiences many fears throughout their lives, including public speaking, asserting themselves, making decisions, intimacy, being alone, ageing, etc. This bestseller offers the insight and tools to deal with such fears.",
          "goodReadsBookId":"1458867",
          "image":"https://books.google.com/books/content?id=Pg8cZb-9C5IC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780099741008",
          "pageCount":226,
          "publicationDate":"1991",
          "publisher":"Random House",
          "ratingCount":26215,
          "title":"Feel the Fear and Do it Anyway"
       },
       {
          "author":"Adam Grant",
          "averageRating":3.96,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"9f6857b6-94d6-4662-88c7-c0d1e76b6688",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-10-03 07:59:48",
          "description":"\"Using surprising studies and stories spanning business, politics, sports, and entertainment, Grant explores how to recognize a good idea, speak up without getting silenced, build a coalition of allies, choose the right time to act, and manage fear and doubt; how parents and teachers can nurture originality in children; and how leaders can fight groupthink to build cultures that welcome dissent\"--",
          "goodReadsBookId":"33826583",
          "image":"https://books.google.com/books/content?id=pI3cDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780143128854",
          "pageCount":336,
          "publicationDate":"2017-02",
          "publisher":"Penguin",
          "ratingCount":34340,
          "title":"Originals"
       }
    ]
 }