{
    "name":"Humberto Linero",
    "image":"https://avatars.githubusercontent.com/u/17732781?v=4",
    "book_count":60,
    "collections":15,
    "recently_added":[
       {
          "author":"Ken McElroy",
          "averageRating":4.08,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"cfcb25c8-423d-4f85-819d-b4bc0b298a2a",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-10-02 12:03:28",
          "description":"This book will teach you how to: • Achieve wealth and cash flow through real estate • Find property with real potential • Show you how to unlock the myths that are holding you back • Negotiating the deal based on the numbers • Evaluate property and purchase price • Increase your income through proven property management tools",
          "goodReadsBookId":"19100553",
          "image":"https://books.google.com/books/content?id=Z7aaAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781937832384",
          "pageCount":220,
          "publicationDate":"2013-02-28",
          "publisher":"RDA Press, LLC",
          "ratingCount":5006,
          "title":"The ABCs of Real Estate Investing"
       },
       {
          "author":"Ken McElroy",
          "averageRating":4.09,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"cfcb25c8-423d-4f85-819d-b4bc0b298a2a",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-10-02 12:03:42",
          "description":"If you're interested in real estate investing, you may have noticed the lack of coverage it gets in mainstream financial media, while stocks, bonds, and mutual funds are consistently touted as the safest and most profitable ways to invest. According to real estate guru Ken McElroy, that's because financial publications, tv and radio programs make the bulk of their money from advertising paid for by the very companies who provide such mainstream financial services. On the other hand, real estate investment is something you can do on your own--without a large amount of money up front. Picking up where he left off in the bestselling ABC's of Real Estate Investing, McElroy reveals the next essential lessons and information that no serious investor can afford to miss. Building on the foundation of real estate investment 101, McElroy tells readers: How to think--and operate--like a real estate mogul How to identify and close expert deals Why multifamily housing is the best real estate investment out there How to surround yourself with a team that will help maximize your money How to avoid paying thousands in taxes by structuring property sales wisely Important projections about the future of real estate investment",
          "goodReadsBookId":"23230382",
          "image":"https://books.google.com/books/content?id=OzMkAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781937832520",
          "pageCount":175,
          "publicationDate":"2013-11-05",
          "publisher":"RDA Press, LLC",
          "ratingCount":398,
          "title":"The Advanced Guide to Real Estate Investing"
       },
       {
          "author":"Tom Wheelwright",
          "averageRating":4.25,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"cfcb25c8-423d-4f85-819d-b4bc0b298a2a",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-10-02 12:10:14",
          "description":"Do you hate taxes? Dread tax season each year? Wheelwright teaches you in plain English how to use the tax code to make you richer. From paying less taxes to surviving an audit, you'll learn to use your tax savings to build tremendous wealth.",
          "goodReadsBookId":"13238716",
          "image":"https://books.google.com/books/content?id=5E0GywAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781937832056",
          "pageCount":320,
          "publicationDate":"2012",
          "publisher":"RDA Press, LLC",
          "ratingCount":949,
          "title":"Tax-Free Wealth"
       },
       {
          "author":"Robert Kiyosaki",
          "averageRating":3.38,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"cfcb25c8-423d-4f85-819d-b4bc0b298a2a",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-10-02 17:25:23",
          "description":"It's estimated that there are over 50 million pensioners--in the United States alone. Like the United States, the United Kingdom, Japan, Italy, Germany and many other countries around the world are all in big trouble when it comes to the solvency of their pension funds. Who Stole My Pension? was written to give them guidance, resources, and tools so they can take action... and stop the looting. We are in the early stages of the greatest retirement crisis in the history of our nation and, indeed, the entire world. According to the World Health Organization, nearly two billion people around the world are expected to be over age 60 by 2050, a figure that's more than triple what it was in 2000. For better or for worse, never before have there been more elderly people living on planet Earth. One thing is. certain: Doing nothing--sitting back, confident your pension check is \"in the mail\"--is not an option. That's a risk you can't afford to take. According to Edward Siedle, a former attorney with the United States Securities and Exchange Commission and America's leading expert in pension looting, \"In the decades to come, we will witness hundreds of millions of elders worldwide, including America's Baby Boomers, slipping into poverty. Too frail to work, too poor to retire will become the \"new normal\" for many of the aged.\" Kiyosaki, who like Siedle saw this crisis looming years ago, complements the facts and stats Siedle puts forth with strategies on how retirees can take control--not only their pensions, but their financial futures. Kiyosaki writes about the fact that his father, a highly educated man he calls his poor dad, wasn't poor until he lost his job, his paycheck--and his pension. \"His PHD couldn't save him,\" says Kiyosaki, who has dedicated his life to teaching and financial literacy advocacy. In Who Stole My Pension? the authors focus on the most misunderstood and ignored cause of the pension crisis: mismanagement of pensions and investments. The culprits that are looting the pensions of public school teachers, firefighters, police, as well as private sector workers, are on Wall Street. The Wall Street casinos charging high fees for gambling in risky hedge funds and other speculative investments, outrageous investment-industry conflicts of interest, and outright violations of the law. Who Stole My Pension? is an in-depth assessment of the pension crisis that the world is facing today and what millions around the world--employees who expected to have pension income at retirement--can do about it. The authors recount a history of pension failures, inexperienced boards, gambling, looting and other horror stories--with a focus on action steps workers and retirees can take to quickly determine if a pension is being mismanaged as well as the concrete steps they can take to end decades of pension mismanagement. They detail critical questions retirees can ask--and guidance regarding how to act on what they learn.",
          "goodReadsBookId":"50252196",
          "image":"https://books.google.com/books/content?id=Pk4nzAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781612681030",
          "pageCount":240,
          "publicationDate":"2020-01-14",
          "publisher":"",
          "ratingCount":24,
          "title":"Who Stole My Pension?"
       },
       {
          "author":"Bert Dohmen",
          "averageRating":5,
          "categories":[
             "International finance"
          ],
          "collectionId":"cfcb25c8-423d-4f85-819d-b4bc0b298a2a",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-10-02 17:42:21",
          "description":"",
          "goodReadsBookId":"3233840",
          "image":"https://mobileappresources.s3.eu-north-1.amazonaws.com/BookReviewApp/cover_image.jpg",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780615196596",
          "pageCount":239,
          "publicationDate":"2007",
          "publisher":"",
          "ratingCount":1,
          "title":"Prelude to Meltdown"
       },
       {
          "author":"Buckminster Fuller",
          "averageRating":5,
          "categories":[
             
          ],
          "collectionId":"cfcb25c8-423d-4f85-819d-b4bc0b298a2a",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-10-05 12:05:10",
          "description":"Buckminster Fuller takes on the gigantic corporate megaliths that exert increasing control over every aspect of daily life. In the form of a modern allegory, he traces the evolution of these multinational giants from the post-World War II military-industrial complex to the current army of abstract legal entities known as the corporate world. GRUNCH stands for Gross Universal Cash Heist.",
          "goodReadsBookId":"45944781",
          "image":"https://books.google.com/books/content?id=qYN4xQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781096795766",
          "pageCount":130,
          "publicationDate":"2019-05-03",
          "publisher":"Independently Published",
          "ratingCount":1,
          "title":"Grunch of Giants"
       },
       {
          "author":"Michael Crichton",
          "averageRating":3.64,
          "categories":[
             "Fiction"
          ],
          "collectionId":"cfcb25c8-423d-4f85-819d-b4bc0b298a2a",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-10-06 11:50:11",
          "description":"From the author of Jurassic Park, Timeline, and Sphere comes this riveting thriller of corporate intrigue and cutthroat competition between American and Japanese business interests. #1 NEW YORK TIMES BESTSELLER “As well built a thrill machine as a suspense novel can be.”—The New York Times Book Review On the forty-fifth floor of the Nakamoto tower in downtown Los Angeles—the new American headquarters of the immense Japanese conglomerate—a grand opening celebration is in full swing. On the forty-sixth floor, in an empty conference room, the corpse of a beautiful young woman is discovered. The investigation immediately becomes a headlong chase through a twisting maze of industrial intrigue, a no-holds-barred conflict in which control of a vital American technology is the fiercely coveted prize—and in which the Japanese saying “Business is war” takes on a terrifying reality. “A grand maze of plot twists . . . Crichton’s gift for spinning a timely yarn is going to be enough, once again, to serve a current tenant of the bestseller list with an eviction notice.”—New York Daily News “The action in Rising Sun unfolds at a breathless pace.”—Business Week",
          "goodReadsBookId":"13641856",
          "image":"https://books.google.com/books/content?id=QwJJghkMkmUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780307763068",
          "pageCount":416,
          "publicationDate":"2012-05-14",
          "publisher":"Ballantine Books",
          "ratingCount":48889,
          "title":"Rising Sun: A Novel"
       },
       {
          "author":"Robert T. Kiyosaki",
          "averageRating":4.26,
          "categories":[
             
          ],
          "collectionId":"cfcb25c8-423d-4f85-819d-b4bc0b298a2a",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-10-09 21:52:54",
          "description":"-",
          "goodReadsBookId":"81922",
          "image":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1483023081l/81922._SX98_.jpg",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780446677479",
          "pageCount":376,
          "publicationDate":"-",
          "publisher":"-",
          "ratingCount":109204,
          "title":"Rich Dad's Cashflow Quadrant: Rich Dad's Guide to Financial Freedom"
       },
       {
          "author":"John MacGregor",
          "averageRating":4.24,
          "categories":[
             
          ],
          "collectionId":"cfcb25c8-423d-4f85-819d-b4bc0b298a2a",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-11-22 14:00:04",
          "description":"Learning from your mistakes makes you smart. Learning from other people's mistakes makes you a genius. There are two ways to share knowledge, you can push information out or you can pull them in with story. A good story well told, can change the world. After 25 years in the trenches working with thousands of individuals and small business owners, John MacGregor opens the vault on 10 incredible stories that have the power to transform your financial life forever. In this book MacGregor reveals 10 real-life stories of people he encountered who had everythng and lost it all. It is here, MacGreogor reveals for the first time \"The B.E.A.R Trap\", THE four underlying reasons why so many people go and stay broke. Using jaw dropping stories, this book answers and solves why:* 78% of people are living paycheck to paycheck* 65% of people could not come up with $400 today for an emergency expense* Why money is the #1 source of stress in our society* AND, why this problem is getting worse - not better - despite the thousands of how-to-books, DVD, and online resources available. Unlike the thousands of traditional \"how-to\" personal finance books that use traditional methods that rarely elicit change in people, these stories elicit something deep within the reader that allows people to make meaningful transformations in their life. The BEAR Trap formula is not only effective in your financial decision making, you can use it anywhere in your life to avoid painful outcomes and pitfalls. Though this is about the rich going broke, the amount of money doesn't matter as everyone of these stories can pertain to you and your family",
          "goodReadsBookId":"46139461",
          "image":"https://books.google.com/books/content?id=cclyvgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781947588097",
          "pageCount":240,
          "publicationDate":"2020-05-26",
          "publisher":"RDA Press, LLC",
          "ratingCount":21,
          "title":"The Top 10 Reasons the Rich Go Broke"
       },
       {
          "author":"Thomas C. Corley",
          "averageRating":3.73,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"cfcb25c8-423d-4f85-819d-b4bc0b298a2a",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-12-05 18:41:51",
          "description":"Offers a step-by-step financial success program that is concise, easy to understand and apply.",
          "goodReadsBookId":"14642813",
          "image":"https://books.google.com/books/content?id=Qq8wlw-BvlwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781934938935",
          "pageCount":89,
          "publicationDate":"2010-03-01",
          "publisher":"Hillcrest Publishing Group",
          "ratingCount":1164,
          "title":"Rich Habits"
       },
       {
          "author":"Eric Tyson",
          "averageRating":3.85,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"cfcb25c8-423d-4f85-819d-b4bc0b298a2a",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2021-03-17 09:59:47",
          "description":"Everything you need to confidently make real estate part of your investing plan Do you want to get involved in real estate investing, but aren't quite sure where to start? Real Estate Investing For Dummies is your go-to resource for making sense of the subject, offering plain-English, step-by-step explanations of everything you need to know to keep yourself one step ahead of the competition. Inside, you'll discover how to overcome the challenges of the market, take advantage of the opportunities in any real estate environment—including a down market—and so much more. Written by industry experts Eric Tyson and Robert Griswold, this new edition of Real Estate Investing For Dummies offers proven, practical, and actionable advice for anyone who wants to invest in income-producing properties. With the help of this straightforward and time-tested information, you'll get the know-how to wisely and confidently make smart, sound, and informed real estate investing decisions that will reap big rewards. Shows you how to make real estate part of your long-term investment plan Provides tips on getting the best deals on financing Offers trusted guidance on mastering the art of property valuation Gives you access to unprecedented information on how to build wealth in any market If you want to jump into the real estate market as a first-time investor or just want to brush up on recent changes that have occurred in the field, Real Estate Investing For Dummies is an essential resource you'll turn to again and again.",
          "goodReadsBookId":"22775500",
          "image":"https://books.google.com/books/content?id=9JBxBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9781118948217",
          "pageCount":416,
          "publicationDate":"2015-02-23",
          "publisher":"John Wiley & Sons",
          "ratingCount":370,
          "title":"Real Estate Investing For Dummies"
       }
    ],
    "recently_read":[
       {
          "author":"David Waller",
          "averageRating":3.35,
          "categories":[
             "BUSINESS & ECONOMICS"
          ],
          "collectionId":"004c214c-b95d-4bf8-8b61-a3d2e2949ac5",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:41:43",
          "description":"Your reputation affects everything, the opportunities that come your way in business and in life - learn the rules to life's most important game...",
          "goodReadsBookId":"39987608",
          "image":"https://books.google.com/books/content?id=k1q2tAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781786073518",
          "pageCount":304,
          "publicationDate":"2018-06-07",
          "publisher":"Oneworld",
          "ratingCount":108,
          "title":"The Reputation Game"
       },
       {
          "author":"Scott Adams",
          "averageRating":3.75,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"0fd24d9d-48d3-431c-a9ff-3d645e3bb840",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:54:04",
          "description":"Scott Adams -- a trained hypnotist and a lifelong student of persuasion -- was one of the earliest public figures to predict Trump's win, doing so a week after Nate Silver put Trump's odds at 2 percent in his FiveThirtyEight.com blog. The mainstream media regarded Trump as a novelty and a sideshow. But Adams recognized in Trump a level of persuasion you only see once in a generation. Trump triggered massive cognitive dissonance and confirmation bias on both the left and the right. We're hardwired to respond to emotion, not reason. We might listen to 10 percent of a speech -- a hand gesture here, a phrase there -- and if the right buttons are pushed, we irrationally agree with the speaker and invent reasons to justify that decision after the fact. The point isn't whether Trump was right or wrong, good or bad. Win Bigly goes beyond politics to look at persuasion tools that can work in any setting -- the same ones Adams saw in Steve Jobs when he invested in Apple decades ago.",
          "goodReadsBookId":"34427205",
          "image":"https://books.google.com/books/content?id=BeY3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":true,
          "isLent":false,
          "isRead":true,
          "isbn":"9780735219717",
          "pageCount":304,
          "publicationDate":"2017",
          "publisher":"Penguin",
          "ratingCount":3371,
          "title":"Win Bigly"
       },
       {
          "author":"Daniel H. Pink",
          "averageRating":4.14,
          "categories":[
             
          ],
          "collectionId":"0fd24d9d-48d3-431c-a9ff-3d645e3bb840",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:57:56",
          "description":"We're all in Sales nowParents sell their kids on going to bed. Spouses sell their partners on mowing the lawn. We sell our bosses on giving us more money and more time off. And in astonishing numbers we go online to sell ourselves on Facebook, Twitter and online dating profiles. Relying on science, analysis and his trademark clarity of thought, Daniel Pink shows that sales isn't what it used to be. Then he provides a set of tools, tips, and exercises for succeeding on each new terrain: six new ways to pitch your idea, three ways to understand another's perspective, five frames that can make your message clearer, and much more.",
          "goodReadsBookId":"42142398",
          "image":"https://books.google.com/books/content?id=WaV2vgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9781786891716",
          "pageCount":272,
          "publicationDate":"2018-06-21",
          "publisher":"",
          "ratingCount":35,
          "title":"To Sell is Human"
       },
       {
          "author":"Helen Armstrong",
          "averageRating":3.96,
          "categories":[
             "Design"
          ],
          "collectionId":"0e6c4712-ec61-46d3-a14d-1de3a73271f7",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:11:19",
          "description":"Digital Design Theory bridges the gap between the discourse of print design and interactive experience by examining the impact of computation on the field of design. As graphic design moves from the creation of closed, static objects to the development of open, interactive frameworks, designers seek to understand their own rapidly shifting profession. Helen Armstrong's carefully curated introduction to groundbreaking primary texts, from the 1960s to the present, provides the background necessary for an understanding of digital design vocabulary and thought. Accessible essays from designers and programmers are by influential figures such as Ladislav Sutnar, Bruno Munari, Wim Crouwel, Sol LeWitt, Muriel Cooper, Zuzana Licko, Rudy VanderLans, John Maeda, Paola Antonelli, Luna Maurer, and Keetra Dean Dixon. Their topics range from graphic design's fascination with programmatic design, to early strivings for an authentic digital aesthetic, to the move from object-based design and to experience-based design. Accompanying commentary assesses the relevance of each excerpt to the working and intellectual life of designers.",
          "goodReadsBookId":"30775613",
          "image":"https://books.google.com/books/content?id=D0UEDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781616894955",
          "pageCount":152,
          "publicationDate":"2016-06-28",
          "publisher":"Chronicle Books",
          "ratingCount":28,
          "title":"Digital Design Theory"
       },
       {
          "author":"James Pannafino",
          "averageRating":3.64,
          "categories":[
             "Computers"
          ],
          "collectionId":"0e6c4712-ec61-46d3-a14d-1de3a73271f7",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:13:06",
          "description":"\"Interaction design has many dimensions to it. It addresses how people deal with words, read images, explore physical space, think about time and motion, and how actions and responses affect human behavior. Various disciplines make up interaction design, such as industrial design, cognitive psychology, user interface design and many others. It is my hope that this book is a starting point for creating a visual language to enhance the understanding of interdisciplinary theories within interaction design. The book uses concise descriptions, visual metaphors and comparative diagrams to explain each term's meaning. Many ideas in this book are based on timeless principles that will function in varying contexts\"--Provided by author.",
          "goodReadsBookId":"6157547",
          "image":"https://books.google.com/books/content?id=Wk5fmwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780982634813",
          "pageCount":94,
          "publicationDate":"2012",
          "publisher":"",
          "ratingCount":91,
          "title":"Interdisciplinary Interaction Design"
       },
       {
          "author":"Susan Weinschenk",
          "averageRating":4.1,
          "categories":[
             "Computers"
          ],
          "collectionId":"0e6c4712-ec61-46d3-a14d-1de3a73271f7",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:13:58",
          "description":"We design to elicit responses from people. We want them to buy something, read more, or take action of some kind. Designing without understanding what makes people act the way they do is like exploring a new city without a map: results will be haphazard, confusing, and inefficient. This book combines real science and research with practical examples to deliver a guide every designer needs. With it you’ll be able to design more intuitive and engaging work for print, websites, applications, and products that matches the way people think, work, and play. Learn to increase the effectiveness, conversion rates, and usability of your own design projects by finding the answers to questions such as: What grabs and holds attention on a page or screen? What makes memories stick? What is more important, peripheral or central vision? How can you predict the types of errors that people will make? What is the limit to someone’s social circle? How do you motivate people to continue on to (the next step? What line length for text is best? Are some fonts better than others? These are just a few of the questions that the book answers in its deep-dive exploration of what makes people tick.",
          "goodReadsBookId":"11670989",
          "image":"https://books.google.com/books/content?id=yODWdMUhkFwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780132658607",
          "pageCount":256,
          "publicationDate":"2011-04-14",
          "publisher":"Pearson Education",
          "ratingCount":4269,
          "title":"100 Things Every Designer Needs to Know About People"
       },
       {
          "author":"Helen Armstrong",
          "averageRating":3.96,
          "categories":[
             "Design"
          ],
          "collectionId":"0e6c4712-ec61-46d3-a14d-1de3a73271f7",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:11:19",
          "description":"Digital Design Theory bridges the gap between the discourse of print design and interactive experience by examining the impact of computation on the field of design. As graphic design moves from the creation of closed, static objects to the development of open, interactive frameworks, designers seek to understand their own rapidly shifting profession. Helen Armstrong's carefully curated introduction to groundbreaking primary texts, from the 1960s to the present, provides the background necessary for an understanding of digital design vocabulary and thought. Accessible essays from designers and programmers are by influential figures such as Ladislav Sutnar, Bruno Munari, Wim Crouwel, Sol LeWitt, Muriel Cooper, Zuzana Licko, Rudy VanderLans, John Maeda, Paola Antonelli, Luna Maurer, and Keetra Dean Dixon. Their topics range from graphic design's fascination with programmatic design, to early strivings for an authentic digital aesthetic, to the move from object-based design and to experience-based design. Accompanying commentary assesses the relevance of each excerpt to the working and intellectual life of designers.",
          "goodReadsBookId":"30775613",
          "image":"https://books.google.com/books/content?id=D0UEDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781616894955",
          "pageCount":152,
          "publicationDate":"2016-06-28",
          "publisher":"Chronicle Books",
          "ratingCount":28,
          "title":"Digital Design Theory"
       },
       {
          "author":"James Pannafino",
          "averageRating":3.64,
          "categories":[
             "Computers"
          ],
          "collectionId":"0e6c4712-ec61-46d3-a14d-1de3a73271f7",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:13:06",
          "description":"\"Interaction design has many dimensions to it. It addresses how people deal with words, read images, explore physical space, think about time and motion, and how actions and responses affect human behavior. Various disciplines make up interaction design, such as industrial design, cognitive psychology, user interface design and many others. It is my hope that this book is a starting point for creating a visual language to enhance the understanding of interdisciplinary theories within interaction design. The book uses concise descriptions, visual metaphors and comparative diagrams to explain each term's meaning. Many ideas in this book are based on timeless principles that will function in varying contexts\"--Provided by author.",
          "goodReadsBookId":"6157547",
          "image":"https://books.google.com/books/content?id=Wk5fmwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780982634813",
          "pageCount":94,
          "publicationDate":"2012",
          "publisher":"",
          "ratingCount":91,
          "title":"Interdisciplinary Interaction Design"
       },
       {
          "author":"Susan Weinschenk",
          "averageRating":4.1,
          "categories":[
             "Computers"
          ],
          "collectionId":"0e6c4712-ec61-46d3-a14d-1de3a73271f7",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-19 16:13:58",
          "description":"We design to elicit responses from people. We want them to buy something, read more, or take action of some kind. Designing without understanding what makes people act the way they do is like exploring a new city without a map: results will be haphazard, confusing, and inefficient. This book combines real science and research with practical examples to deliver a guide every designer needs. With it you’ll be able to design more intuitive and engaging work for print, websites, applications, and products that matches the way people think, work, and play. Learn to increase the effectiveness, conversion rates, and usability of your own design projects by finding the answers to questions such as: What grabs and holds attention on a page or screen? What makes memories stick? What is more important, peripheral or central vision? How can you predict the types of errors that people will make? What is the limit to someone’s social circle? How do you motivate people to continue on to (the next step? What line length for text is best? Are some fonts better than others? These are just a few of the questions that the book answers in its deep-dive exploration of what makes people tick.",
          "goodReadsBookId":"11670989",
          "image":"https://books.google.com/books/content?id=yODWdMUhkFwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780132658607",
          "pageCount":256,
          "publicationDate":"2011-04-14",
          "publisher":"Pearson Education",
          "ratingCount":4269,
          "title":"100 Things Every Designer Needs to Know About People"
       },
       {
          "author":"K. N. Kukoyi",
          "averageRating":3.67,
          "categories":[
             "Application software"
          ],
          "collectionId":"649246bc-e1b7-4e96-ac44-a6ddae4df1fa",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-07 10:33:19",
          "description":"A software survival guide for non-technical entrepreneurs entering the tech space who want to reduce the uncertainty associated to starting their business, and for seed startups who require support and ideas when dealing with the daily realities of managing the software development process and getting a quality software application built and launched.",
          "goodReadsBookId":"35252184",
          "image":"https://books.google.com/books/content?id=yzqGswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9781539188193",
          "pageCount":386,
          "publicationDate":"2017-05-26",
          "publisher":"Createspace Independent Publishing Platform",
          "ratingCount":3,
          "title":"Don't Hire a Software Developer Until You Read This Book"
       },
       {
          "author":"David Sumpter",
          "averageRating":3.98,
          "categories":[
             "Mathematics"
          ],
          "collectionId":"649246bc-e1b7-4e96-ac44-a6ddae4df1fa",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-11 15:00:12",
          "description":"Outnumbered is a journey to the dark side of mathematics, from how it dictates our social media activities to our travel routes. Algorithms are running our society, and as Facebook's Cambridge Analytica scandal has revealed, we don't even realize how our data has been used against us. David Sumpter investigates whether mathematics is crossing dangerous lines when it comes to what we can make decisions about. Our increasing reliance on technology and the internet has opened a window for mathematicians and data researchers to gaze through into our lives. Using the data they are constantly collecting about where we travel, where we shop, what we buy, and what interests us, they can begin to predict our daily habits, and increasingly we are relinquishing our decision-making to algorithms. Are we giving this up too easily? Without understanding what mathematics can and can't do it is impossible to get a handle on how it is changing our lives. In this book, David Sumpter takes an algorithm-strewn journey to the dark side of mathematics. He investigates the equations that analyze us, influence us and will (maybe) become like us, answering questions like: Who are Cambridge Analytica, and what are they doing with our data? How does Facebook build a 100-dimensional picture of your personality? Are Google algorithms racist and sexist? Why do election predictions fail so drastically? Are algorithms that are designed to find criminals making terrible mistakes? What does the future hold as we relinquish our decision-making to machines? Featuring interviews with those working at the cutting edge of algorithm, Outnumbered explains how mathematics and statistics work in the real world, and what we should and shouldn't worry about.",
          "goodReadsBookId":"36762542",
          "image":"https://books.google.com/books/content?id=R14stAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9781472947413",
          "pageCount":272,
          "publicationDate":"2018-06-19",
          "publisher":"Bloomsbury Sigma",
          "ratingCount":250,
          "title":"Outnumbered"
       }
    ],
    "favorite":[
       {
          "author":"Viktor Mayer-Schönberger",
          "averageRating":3.71,
          "categories":[
             "Business & Economics"
          ],
          "collectionId":"649246bc-e1b7-4e96-ac44-a6ddae4df1fa",
          "dateAddedToFirebase":"",
          "dateAddedToLocalDB":"2020-03-11 15:00:24",
          "description":"New and expanded edition. An International Bestseller - Over One Million Copies Sold! Shortlisted for the Financial Times/Goldman Sachs Business Book of the Year Award. Since Aristotle, we have fought to understand the causes behind everything. But this ideology is fading. In the age of big data, we can crunch an incomprehensible amount of information, providing us with invaluable insights about the what rather than the why. We're just starting to reap the benefits: tracking vital signs to foresee deadly infections, predicting building fires, anticipating the best moment to buy a plane ticket, seeing inflation in real time and monitoring social media in order to identify trends. But there is a dark side to big data. Will it be machines, rather than people, that make the decisions? How do you regulate an algorithm? What will happen to privacy? Will individuals be punished for acts they have yet to commit? In this groundbreaking and fascinating book, two of the world's most-respected data experts reveal the reality of a big data world and outline clear and actionable steps that will equip the reader with the tools needed for this next phase of human evolution.",
          "goodReadsBookId":"34686572",
          "image":"https://books.google.com/books/content?id=ee9BDQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9781473647206",
          "pageCount":320,
          "publicationDate":"2017-01-10",
          "publisher":"John Murray",
          "ratingCount":7209,
          "title":"Big Data"
       },
       {
          "author":"Pratap Dangeti",
          "averageRating":3.4,
          "categories":[
             "Computers"
          ],
          "collectionId":"649246bc-e1b7-4e96-ac44-a6ddae4df1fa",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-06 17:57:57",
          "description":"Build Machine Learning models with a sound statistical understanding. About This Book Learn about the statistics behind powerful predictive models with p-value, ANOVA, and F- statistics. Implement statistical computations programmatically for supervised and unsupervised learning through K-means clustering. Master the statistical aspect of Machine Learning with the help of this example-rich guide to R and Python. Who This Book Is For This book is intended for developers with little to no background in statistics, who want to implement Machine Learning in their systems. Some programming knowledge in R or Python will be useful. What You Will Learn Understand the Statistical and Machine Learning fundamentals necessary to build models Understand the major differences and parallels between the statistical way and the Machine Learning way to solve problems Learn how to prepare data and feed models by using the appropriate Machine Learning algorithms from the more-than-adequate R and Python packages Analyze the results and tune the model appropriately to your own predictive goals Understand the concepts of required statistics for Machine Learning Introduce yourself to necessary fundamentals required for building supervised & unsupervised deep learning models Learn reinforcement learning and its application in the field of artificial intelligence domain In Detail Complex statistics in Machine Learning worry a lot of developers. Knowing statistics helps you build strong Machine Learning models that are optimized for a given problem statement. This book will teach you all it takes to perform complex statistical computations required for Machine Learning. You will gain information on statistics behind supervised learning, unsupervised learning, reinforcement learning, and more. Understand the real-world examples that discuss the statistical side of Machine Learning and familiarize yourself with it. You will also design programs for performing tasks such as model, parameter fitting, regression, classification, density collection, and more. By the end of the book, you will have mastered the required statistics for Machine Learning and will be able to apply your new skills to any sort of industry problem. Style and approach This practical, step-by-step guide will give you an understanding of the Statistical and Machine Learning fundamentals you'll need to build models.",
          "goodReadsBookId":"35873662",
          "image":"https://books.google.com/books/content?id=C-dDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781788291224",
          "pageCount":442,
          "publicationDate":"2017-07-21",
          "publisher":"Packt Publishing Ltd",
          "ratingCount":20,
          "title":"Statistics for Machine Learning"
       },
       {
          "author":"Kim Zetter",
          "averageRating":4.14,
          "categories":[
             "History"
          ],
          "collectionId":"649246bc-e1b7-4e96-ac44-a6ddae4df1fa",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-04-11 19:23:26",
          "description":"Top cybersecurity journalist Kim Zetter tells the story behind the virus that sabotaged Iran’s nuclear efforts and shows how its existence has ushered in a new age of warfare—one in which a digital attack can have the same destructive capability as a megaton bomb. In January 2010, inspectors with the International Atomic Energy Agency noticed that centrifuges at an Iranian uranium enrichment plant were failing at an unprecedented rate. The cause was a complete mystery—apparently as much to the technicians replacing the centrifuges as to the inspectors observing them. Then, five months later, a seemingly unrelated event occurred: A computer security firm in Belarus was called in to troubleshoot some computers in Iran that were crashing and rebooting repeatedly. At first, the firm’s programmers believed the malicious code on the machines was a simple, routine piece of malware. But as they and other experts around the world investigated, they discovered a mysterious virus of unparalleled complexity. They had, they soon learned, stumbled upon the world’s first digital weapon. For Stuxnet, as it came to be known, was unlike any other virus or worm built before: Rather than simply hijacking targeted computers or stealing information from them, it escaped the digital realm to wreak actual, physical destruction on a nuclear facility. In these pages, Wired journalist Kim Zetter draws on her extensive sources and expertise to tell the story behind Stuxnet’s planning, execution, and discovery, covering its genesis in the corridors of Bush’s White House and its unleashing on systems in Iran—and telling the spectacular, unlikely tale of the security geeks who managed to unravel a sabotage campaign years in the making. But Countdown to Zero Day ranges far beyond Stuxnet itself. Here, Zetter shows us how digital warfare developed in the US. She takes us inside today’s flourishing zero-day “grey markets,” in which intelligence agencies and militaries pay huge sums for the malicious code they need to carry out infiltrations and attacks. She reveals just how vulnerable many of our own critical systems are to Stuxnet-like strikes, from nation-state adversaries and anonymous hackers alike—and shows us just what might happen should our infrastructure be targeted by such an attack. Propelled by Zetter’s unique knowledge and access, and filled with eye-opening explanations of the technologies involved, Countdown to Zero Day is a comprehensive and prescient portrait of a world at the edge of a new kind of war.",
          "goodReadsBookId":"22926847",
          "image":"https://books.google.com/books/content?id=1l2YAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780770436186",
          "pageCount":448,
          "publicationDate":"2014-11-11",
          "publisher":"Crown",
          "ratingCount":4459,
          "title":"Countdown to Zero Day"
       },
       {
          "author":"Venkat Subramaniam",
          "averageRating":4.79,
          "categories":[
             "Computers"
          ],
          "collectionId":"649246bc-e1b7-4e96-ac44-a6ddae4df1fa",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-06-23 17:34:46",
          "description":"Programmers don't just use Kotlin, they love it. Even Google has adopted it as a first-class language for Android development. With Kotlin, you can intermix imperative, functional, and object-oriented styles of programming and benefit from the approach that's most suitable for the problem at hand. Learn to use the many features of this highly concise, fluent, elegant, and expressive statically typed language with easy-to-understand examples. Learn to write easy-to-maintain, high-performing JVM and Android applications, create DSLs, program asynchrony, and much more. Kotlin is a highly concise, elegant, fluent, and expressive statically typed multi-paradigm language. It is one of the few languages that compiles down to both Java bytecode and JavaScript. You can use it to build server-side, front-end, and Android applications. With Kotlin, you need less code to accomplish your tasks, while keeping the code type-safe and less prone to error. If you want to learn the essentials of Kotlin, from the fundamentals to more advanced concepts, you've picked the right book. Fire up your favorite IDE and practice hundreds of examples and exercises to sharpen your Kotlin skills. Learn to build standalone small programs to run as scripts, create type safe code, and then carry that knowledge forward to create fully object-oriented and functional style code that's easier to extend. Learn how to program with elegance but without compromising efficiency or performance, and how to use metaprogramming to build highly expressive code and create internal DSLs that exploit the fluency of the language. Explore coroutines, program asynchrony, run automated tests, and intermix Kotlin with Java in your enterprise applications. This book will help you master one of the few languages that you can use for the entire full stack - from the server to mobile devices - to create performant, concise, and easy to maintain applications. What You Need: To try out the examples in the book you'll need a computer with Kotlin SDK, JDK, and a text editor or a Kotlin IDE installed in it.",
          "goodReadsBookId":"46159932",
          "image":"https://books.google.com/books/content?id=cIF-vQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781680506358",
          "pageCount":450,
          "publicationDate":"2019-05-31",
          "publisher":"Pragmatic Bookshelf",
          "ratingCount":14,
          "title":"Programming Kotlin"
       },
       {
          "author":"Yegor Bugayenko",
          "averageRating":4.06,
          "categories":[
             
          ],
          "collectionId":"649246bc-e1b7-4e96-ac44-a6ddae4df1fa",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-06-23 17:38:20",
          "description":"TL;DR Compound variable names, validators, private static literals, configurable objects, inheritance, annotations, MVC, dependency injection containers, reflection, ORM and even algorithms are our enemies.",
          "goodReadsBookId":"34975081",
          "image":"https://books.google.com/books/content?id=8rxaswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781534908307",
          "pageCount":222,
          "publicationDate":"2017-04-18",
          "publisher":"Createspace Independent Publishing Platform",
          "ratingCount":200,
          "title":"Elegant Objects"
       },
       {
          "author":"Andy Greenberg",
          "averageRating":0,
          "categories":[
             "Computers"
          ],
          "collectionId":"649246bc-e1b7-4e96-ac44-a6ddae4df1fa",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-07-21 13:49:47",
          "description":"\"Sandworm is much more than a true-life techno-thriller. It's a tour through a realm that is both invisible and critical to the daily lives of every person alive in the 21st century.\" —Los Angeles Times From Wired senior writer Andy Greenberg comes the true story of the most devastating cyberattack in history and the desperate hunt to identify and track the elite Russian agents behind it In 2014, the world witnessed the start of a mysterious series of cyberattacks. Targeting American utility companies, NATO, and electric grids in Eastern Europe, the strikes grew ever more brazen. They culminated in the summer of 2017, when the malware known as NotPetya was unleashed, penetrating, disrupting, and paralyzing some of the world's largest businesses—from drug manufacturers to software developers to shipping companies. At the attack's epicenter in Ukraine, ATMs froze. The railway and postal systems shut down. Hospitals went dark. NotPetya spread around the world, inflicting an unprecedented ten billion dollars in damage—the largest, most destructive cyberattack the world had ever seen. The hackers behind these attacks are quickly gaining a reputation as the most dangerous team of cyberwarriors in history: a group known as Sandworm. Working in the service of Russia's military intelligence agency, they represent a persistent, highly skilled force, one whose talents are matched by their willingness to launch broad, unrestrained attacks on the most critical infrastructure of their adversaries. They target government and private sector, military and civilians alike. A chilling, globe-spanning detective story, Sandworm considers the danger this force poses to our national security and stability. As the Kremlin's role in foreign government manipulation comes into greater focus, Sandworm exposes the realities not just of Russia's global digital offensive, but of an era where warfare ceases to be waged on the battlefield. It reveals how the lines between digital and physical conflict, between wartime and peacetime, have begun to blur—with world-shaking implications.",
          "goodReadsBookId":"",
          "image":"https://books.google.com/books/content?id=ujxrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780385544412",
          "pageCount":368,
          "publicationDate":"2019-11-05",
          "publisher":"Doubleday",
          "ratingCount":0,
          "title":"Sandworm"
       },
       {
          "author":"John Ousterhout",
          "averageRating":4.12,
          "categories":[
             
          ],
          "collectionId":"649246bc-e1b7-4e96-ac44-a6ddae4df1fa",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-07-24 21:47:43",
          "description":"",
          "goodReadsBookId":"39996759",
          "image":"https://books.google.com/books/content?id=pD6-swEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9781732102200",
          "pageCount":0,
          "publicationDate":"2018-04-10",
          "publisher":"Yaknyam Publishing",
          "ratingCount":994,
          "title":"A Philosophy of Software Design"
       },
       {
          "author":"David Hurst Thomas",
          "averageRating":4,
          "categories":[
             "Computers"
          ],
          "collectionId":"649246bc-e1b7-4e96-ac44-a6ddae4df1fa",
          "dateAddedToFirebase":"2020-02-22 13:51:38.308191",
          "dateAddedToLocalDB":"2020-09-01 22:23:20",
          "description":"Using anecdotes, analogies, examples and parables, this user-friendly guide offers techniques for getting any programming job done effectively, and can help any programmer improve skills, no matter what level. Incorporates today's top languages, including Java, C, C++, and Perl.",
          "goodReadsBookId":"45280024",
          "image":"https://books.google.com/books/content?id=sNeFxAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9780135957059",
          "pageCount":352,
          "publicationDate":"2019-09-13",
          "publisher":"Addison-Wesley Professional",
          "ratingCount":14277,
          "title":"The Pragmatic Programmer"
       },
       {
          "author":"Robert C. Martin",
          "averageRating":4.4,
          "categories":[
             "Computers"
          ],
          "collectionId":"649246bc-e1b7-4e96-ac44-a6ddae4df1fa",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2020-12-20 11:02:57",
          "description":"Looks at the principles and clean code, includes case studies showcasing the practices of writing clean code, and contains a list of heuristics and \"smells\" accumulated from the process of writing clean code.",
          "goodReadsBookId":"3735293",
          "image":"https://books.google.com/books/content?id=hjEFCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9780132350884",
          "pageCount":431,
          "publicationDate":"2009",
          "publisher":"Pearson Education",
          "ratingCount":15338,
          "title":"Clean Code"
       },
       {
          "author":"Frederick P. Brooks Jr.",
          "averageRating":4.03,
          "categories":[
             "Computers"
          ],
          "collectionId":"649246bc-e1b7-4e96-ac44-a6ddae4df1fa",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2021-07-08 10:12:14",
          "description":"Few books on software project management have been as influential and timeless as The Mythical Man-Month. With a blend of software engineering facts and thought-provoking opinions, Fred Brooks offers insight for anyone managing complex projects. These essays draw from his experience as project manager for the IBM System/360 computer family and then for OS/360, its massive software system. Now, 20 years after the initial publication of his book, Brooks has revisited his original ideas and added new thoughts and advice, both for readers already familiar with his work and for readers discovering it for the first time. The added chapters contain (1) a crisp condensation of all the propositions asserted in the original book, including Brooks' central argument in The Mythical Man-Month: that large programming projects suffer management problems different from small ones due to the division of labor; that the conceptual integrity of the product is therefore critical; and that it is difficult but possible to achieve this unity; (2) Brooks' view of these propositions a generation later; (3) a reprint of his classic 1986 paper \"No Silver Bullet\"; and (4) today's thoughts on the 1986 assertion, \"There will be no silver bullet within ten years.\"",
          "goodReadsBookId":"8967425",
          "image":"https://books.google.com/books/content?id=Yq35BY5Fk3gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":false,
          "isbn":"9780132119160",
          "pageCount":336,
          "publicationDate":"1995-08-02",
          "publisher":"Pearson Education",
          "ratingCount":12327,
          "title":"The Mythical Man-Month"
       },
       {
          "author":"Andy Hunt",
          "averageRating":4.12,
          "categories":[
             "Computers"
          ],
          "collectionId":"649246bc-e1b7-4e96-ac44-a6ddae4df1fa",
          "dateAddedToFirebase":"2020-01-01",
          "dateAddedToLocalDB":"2022-10-13 10:25:28",
          "description":"Printed in full color. Software development happens in your head. Not in an editor, IDE, or designtool. You're well educated on how to work with software and hardware, but what about wetware--our own brains? Learning new skills and new technology is critical to your career, and it's all in your head. In this book by Andy Hunt, you'll learn how our brains are wired, and how to take advantage of your brain's architecture. You'll learn new tricks and tipsto learn more, faster, and retain more of what you learn. You need a pragmatic approach to thinking and learning. You need to Refactor Your Wetware. Programmers have to learn constantly; not just the stereotypical new technologies, but also the problem domain of the application, the whims of the user community, the quirks of your teammates, the shifting sands of the industry, and the evolving characteristics of the project itself as it is built. We'll journey together through bits of cognitive and neuroscience, learning and behavioral theory. You'll see some surprising aspects of how our brains work, and how you can take advantage of the system to improve your own learning and thinking skills. In this book you'll learn how to: Use the Dreyfus Model of Skill Acquisition to become more expert Leverage the architecture of the brain to strengthen different thinking modes Avoid common \"known bugs\" in your mind Learn more deliberately and more effectively Manage knowledge more efficiently",
          "goodReadsBookId":"38813660",
          "image":"https://books.google.com/books/content?id=OA9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "isFavorite":false,
          "isLent":false,
          "isRead":true,
          "isbn":"9781680504224",
          "pageCount":252,
          "publicationDate":"2008-10-28",
          "publisher":"Pragmatic Bookshelf",
          "ratingCount":4106,
          "title":"Pragmatic Thinking and Learning"
       }
    ]
 }